{
  "sources": [
    {
      "title": "Stochastic Lifestyle",
      "feedUrl": "http://www.stochasticlifestyle.com/feed/",
      "siteUrl": "https://www.stochasticlifestyle.com/",
      "articles": [
        {
          "id": "https://www.stochasticlifestyle.com/?p=1705",
          "author": "Christopher Rackauckas",
          "description": "Part of the COMPUTATIONAL ABSTRACTIONS FOR PROBABILISTIC AND DIFFERENTIABLE PROGRAMMING WORKSHOP\nAbstract: Many probabilistic programming languages (PPLs) attempt to integrate with equation solvers (differential equations, nonlinear equations, partial differential equations, etc.) from the inside, i.e. the developers of the PPLs like Stan provide differential equation solver choices as part of the suite. However, as equation solvers are an entire discipline to themselves with many active development communities and subfields, this places an immense burden on PPL developers to keep up with the changing landscape of tens of thousands of independent researchers. In this talk we will explore how Julia PPLs such as Turing.jl support of equation solvers from the outside, i.e. how the tools of differentiable programming allows equation solver libraries to be compatible with PPLs  ... READ MORE\nThe post Integrating equation solvers with probabilistic programming through differentiable programming appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/integrating-equation-solvers-with-probabilistic-programming-through-differentiable-programming/",
          "publishedOn": "2022-11-24T01:04:59.000Z",
          "wordCount": 1244,
          "title": "Integrating equation solvers with probabilistic programming through differentiable programming",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "http://www.stochasticlifestyle.com/?p=1681",
          "author": "Christopher Rackauckas",
          "description": "Automatic differentiation of a “solver” is a subject with many details for doing it in the most  effective form. For this reason, there are a lot of talks and courses that go into lots of depth on the topic. I recently gave a talk on some of the latest stuff in differentiable simulation with the American Statistical Association, and have some detailed notes on such adjoint derivations as part of the 18.337 Parallel Computing and Scientific Machine Learning graduate course at MIT. And there are entire organizations like my SciML Open Source Software Organization which work day-in and day-out on the development of new differentiable solvers.\nI’ll give a brief summary of all my materials here below.\nContinuous vs Discrete Differentiation of Solvers\nAD of a solver can be done in essentially two different ways: either directly performing automatic  ... READ MORE\nThe post Direct Automatic Differentiation of (Differential Equation) Solvers vs Analytical Adjoints: Which is Better? appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/direct-automatic-differentiation-of-solvers-vs-analytical-adjoints-which-is-better/",
          "publishedOn": "2022-10-11T07:09:53.000Z",
          "wordCount": 3134,
          "title": "Direct Automatic Differentiation of (Differential Equation) Solvers vs Analytical Adjoints: Which is Better?",
          "imageUrl": "http://www.stochasticlifestyle.com/wp-content/uploads/2022/10/Capture7.png"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1670",
          "author": "Christopher Rackauckas",
          "description": "Is differentiable programming actually necessary, or can you just train the neural network in isolation against data and then stick the trained neural network into the simulation? We looked at this problem in detail in our new manuscript titled Capturing missing physics in climate model parameterizations using neural differential equations.\nThe goal of this project is to understand temperature mixing in large eddy simulations, essentially columns of water in the ocean. I.e., can we take a “true” 3D Navier-Stokes and use that to build very quick and accurate models for how heat flows up and down in the water?\n\nThis isn’t a new problem: climate scientists  ... READ MORE\nThe post Is Differentiable Programming Actually Necessary? Can’t you just train the neural networks separately? appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/is-differentiable-programming-actually-necessary-cant-you-just-train-separately/",
          "publishedOn": "2022-10-04T07:38:56.000Z",
          "wordCount": 1510,
          "title": "Is Differentiable Programming Actually Necessary? Can’t you just train the neural networks separately?",
          "imageUrl": "http://www.stochasticlifestyle.com/wp-content/uploads/2022/10/Screenshot-2022-10-03-192913.png"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1659",
          "author": "Christopher Rackauckas",
          "description": "Abstract: Scientific machine learning (SciML) methods allow for the automatic discovery of mechanistic models by infusing neural network training into the simulation process. In this talk we will start by showcasing some of the ways that SciML is being used, from discovery of extrapolatory epidemic models to nonlinear mixed effects models in pharmacology. From there, we will discuss some of the increasingly advanced computational techniques behind the training process, focusing on the numerical issues involved in handling differentiation of highly stiff and chaotic systems. The viewers will leave with an understanding of how compiler techniques are being infused into the simulation stack to increasingly automate the process of developing mechanistic models\nBio: Dr. Chris Rackauckas is the Director of Scientific Research at Pumas-AI, the Director of  ... READ MORE\nThe post Accurate and Efficient Physics-Informed Learning Through Differentiable Simulation (ASA Seminar Talk) appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/accurate-and-efficient-physics-informed-learning-through-differentiable-simulation-asa-seminar-talk/",
          "publishedOn": "2022-07-14T09:58:09.000Z",
          "wordCount": 1317,
          "title": "Accurate and Efficient Physics-Informed Learning Through Differentiable Simulation (ASA Seminar Talk)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1655",
          "author": "Christopher Rackauckas",
          "description": "Keynote Address: New Horizons in Modeling and Simulation in Julia\nPresenters: Viral Shah (Julia Computing, CEO and Co-Founder), Chris Rackauckas (Julia Computing, Director of Modeling and Simulation and Christopher Laughman (Mitsubishi Electric Research Laboratories, Principal Member Research Staff)\nAbstract: As modeling has become more ubiquitous, our models keep growing. The time to build models, verify their behavior, and simulate them is increasing exponentially as we seek more precise predictions. How will our tools change to accommodate the future? Julia’s language design has led to new opportunities. The combination of multiple dispatch, staged compilation, and Julia’s composable libraries have made it possible to build a next generation symbolic-numeric framework. Julia’s abstract interpretation framework enables capabilities such as automatic differentiation, automatic surrogate generation, symbolic tracing, uncertainty propagation, and automatic  ... READ MORE\nThe post Keynote: New Horizons in Modeling and Simulation with Julia (Modelica Conference 2021) appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/keynote-new-horizons-in-modeling-and-simulation-with-julia-modelica-conference-2021/",
          "publishedOn": "2022-06-25T18:11:28.000Z",
          "wordCount": 1221,
          "title": "Keynote: New Horizons in Modeling and Simulation with Julia (Modelica Conference 2021)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1650",
          "author": "Christopher Rackauckas",
          "description": "In this paper we introduce JuliaSim, a high-performance programming environment designed to blend traditional modeling and simulation with machine learning. JuliaSim can build accelerated surrogates from component-based models, such as those conforming to the FMI standard, using continuous-time echo state networks (CTESN). The foundation of this environment, ModelingToolkit.jl, is an acausal modeling language which can compose the trained surrogates as components within its staged compilation process. As a complementary factor we present the JuliaSim model library, a standard library with differential-algebraic equations and pre-trained surrogates, which can be composed using the modeling system for design, optimization, and control. We demonstrate the effectiveness of the surrogate-accelerated modeling and simulation approach on HVAC dynamics by showing that the CTESN surrogates accurately capture the dynamics of a HVAC  ... READ MORE\nThe post Composing Modeling and Simulation with Julia (2021 Modelica Conference) appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/composing-modeling-and-simulation-with-julia-2021-modelica-conference/",
          "publishedOn": "2022-04-08T11:30:11.000Z",
          "wordCount": 1331,
          "title": "Composing Modeling and Simulation with Julia (2021 Modelica Conference)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        }
      ]
    },
    {
      "title": "Andrej Karpathy blog",
      "feedUrl": "http://karpathy.github.io/feed.xml",
      "siteUrl": "http://karpathy.github.io/",
      "articles": []
    },
    {
      "title": "Mosè Giordano",
      "feedUrl": "https://giordano.github.io/blog/feed.xml",
      "siteUrl": "http://giordano.github.io",
      "articles": [
        {
          "id": "http://giordano.github.io/blog/2022-06-18-first-macro/",
          "author": null,
          "description": "This post isn’t about the first macro I wrote in the Julia programming language, but it can be about your first macro. Frequently Asked Questions Question: What are macros in Julia? Answer: Macros are sort of functions which take as input unevaluated expressions (Expr) and return as output another expression,...",
          "link": "http://giordano.github.io/blog/2022-06-18-first-macro/",
          "publishedOn": "2022-06-17T23:00:00.000Z",
          "wordCount": 3067,
          "title": "My first macro in Julia",
          "imageUrl": "http://giordano.github.io/img/avatar.jpeg"
        }
      ]
    },
    {
      "title": "Shuhei Kadowaki&#39;s homepage",
      "feedUrl": "https://aviatesk.github.io/feed.xml",
      "siteUrl": "https://aviatesk.github.io/",
      "articles": [
        {
          "id": "https://aviatesk.github.io/posts/effects-analysis/index.html",
          "author": null,
          "description": "Quick intro to the new effect analysis of Julia compiler",
          "link": "https://aviatesk.github.io/posts/effects-analysis/index.html",
          "publishedOn": "2022-07-24T00:00:00.000Z",
          "wordCount": 2444,
          "title": "Quick intro to the new effect analysis of Julia compiler",
          "imageUrl": "assets/what_about_the_dead_fish.jpeg"
        }
      ]
    },
    {
      "title": "Mike Innes’s Blog",
      "feedUrl": "https://mikeinnes.io/feed.xml",
      "siteUrl": "/",
      "articles": [
        {
          "id": "https://mikeinnes.io/2022/06/29/clocktower.html",
          "author": null,
          "description": "Three years and two months after it launched on Kickstarter, copies of social deduction game Blood on the Clocktower are finally arriving in the UK. During the long wait eager players have been able to backstab each other using print-and-play copies and the online helper (particularly welcome during lockdowns). But it’s nice to have the real thing in our hands. I’m here to commemorate the occassion with statistics, and in particular to show the ranking system I’m using to see how well my players are doing – just for fun, of course.",
          "link": "https://mikeinnes.io/2022/06/29/clocktower.html",
          "publishedOn": "2022-06-29T00:00:00.000Z",
          "wordCount": 1434,
          "title": "Clocktower IQ",
          "imageUrl": null
        },
        {
          "id": "https://mikeinnes.io/2022/06/24/swap.html",
          "author": null,
          "description": "I just put up a draft paper with a proposal for mixing imperative and functional styles of programming. The gist of it is that we can write code like this:",
          "link": "https://mikeinnes.io/2022/06/24/swap.html",
          "publishedOn": "2022-06-24T00:00:00.000Z",
          "wordCount": 330,
          "title": "Imperative Syntax, Functional Semantics",
          "imageUrl": null
        },
        {
          "id": "https://mikeinnes.io/2022/04/01/facespace.html",
          "author": null,
          "description": "The website thispersondoesnotexist.com shows off images created by StyleGAN, a kind of machine learning model trained on around 70,000 headshots from Flickr. Although the photos on the site resemble real ones, they are wholly made up: StyleGAN can generate an unlimited number of convincing faces on the fly, each unique and never to be seen again.",
          "link": "https://mikeinnes.io/2022/04/01/facespace.html",
          "publishedOn": "2022-04-01T00:00:00.000Z",
          "wordCount": 534,
          "title": "Adventures in Face Space",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Tom Kwong's Infinite Loop",
      "feedUrl": "https://ahsmart.com/feed.xml",
      "siteUrl": "https://ahsmart.com/",
      "articles": [
        {
          "id": "https://ahsmart.com/pub/hiring-talents/index.html",
          "author": null,
          "description": "Hiring talents is not the same as finding someone with specific experience\nRead more",
          "link": "https://ahsmart.com/pub/hiring-talents/index.html",
          "publishedOn": "2022-04-09T00:00:00.000Z",
          "wordCount": 883,
          "title": "Hiring talents is not the same as finding someone with specific experience",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "JuliaLang - The Julia programming language",
      "feedUrl": "https://julialang.org/feed.xml",
      "siteUrl": "https://julialang.org/",
      "articles": [
        {
          "id": "https://julialang.org/blog/2022/08/julia-1.8-highlights/",
          "author": null,
          "description": "Highlights of the Julia 1.8 release.\nRead more",
          "link": "https://julialang.org/blog/2022/08/julia-1.8-highlights/",
          "publishedOn": "2022-08-18T00:00:00.000Z",
          "wordCount": 2763,
          "title": "Julia 1.8 Highlights",
          "imageUrl": "/assets/images/julia-open-graph.png"
        },
        {
          "id": "https://julialang.org/blog/2022/08/juliacon-highlights-2022/",
          "author": null,
          "description": "JuliaCon 2022 Highlights\nRead more",
          "link": "https://julialang.org/blog/2022/08/juliacon-highlights-2022/",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 1104,
          "title": "JuliaCon 2022 Highlights",
          "imageUrl": "https://user-images.githubusercontent.com/35577566/183544010-09691b83-9fc6-4b49-b835-d9a8e691e112.png"
        },
        {
          "id": "https://julialang.org/blog/2022/04/simple-chains/",
          "author": null,
          "description": "Doing small network scientific machine learning in Julia 5x faster than PyTorch ...\nRead more",
          "link": "https://julialang.org/blog/2022/04/simple-chains/",
          "publishedOn": "2022-04-14T00:00:00.000Z",
          "wordCount": 4650,
          "title": "Doing small network scientific machine learning in Julia 5x faster than PyTorch",
          "imageUrl": "/assets/images/julia-open-graph.png"
        }
      ]
    },
    {
      "title": "Ted Kaminski",
      "feedUrl": "https://www.tedinski.com/feed.xml",
      "siteUrl": "http://www.tedinski.com/",
      "articles": []
    }
  ],
  "cliVersion": "1.15.1"
}