{
  "sources": [
    {
      "title": "Stochastic Lifestyle",
      "feedUrl": "http://www.stochasticlifestyle.com/feed/",
      "siteUrl": "http://www.stochasticlifestyle.com/",
      "articles": [
        {
          "id": "https://www.stochasticlifestyle.com/?p=1705",
          "author": "Christopher Rackauckas",
          "description": "Part of the COMPUTATIONAL ABSTRACTIONS FOR PROBABILISTIC AND DIFFERENTIABLE PROGRAMMING WORKSHOP\nAbstract: Many probabilistic programming languages (PPLs) attempt to integrate with equation solvers (differential equations, nonlinear equations, partial differential equations, etc.) from the inside, i.e. the developers of the PPLs like Stan provide differential equation solver choices as part of the suite. However, as equation solvers are an entire discipline to themselves with many active development communities and subfields, this places an immense burden on PPL developers to keep up with the changing landscape of tens of thousands of independent researchers. In this talk we will explore how Julia PPLs such as Turing.jl support of equation solvers from the outside, i.e. how the tools of differentiable programming allows equation solver libraries to be compatible with PPLs  ... READ MORE\nThe post Integrating equation solvers with probabilistic programming through differentiable programming appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/integrating-equation-solvers-with-probabilistic-programming-through-differentiable-programming/",
          "publishedOn": "2022-11-24T01:04:59.000Z",
          "wordCount": 1244,
          "title": "Integrating equation solvers with probabilistic programming through differentiable programming",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "http://www.stochasticlifestyle.com/?p=1681",
          "author": "Christopher Rackauckas",
          "description": "Automatic differentiation of a “solver” is a subject with many details for doing it in the most  effective form. For this reason, there are a lot of talks and courses that go into lots of depth on the topic. I recently gave a talk on some of the latest stuff in differentiable simulation with the American Statistical Association, and have some detailed notes on such adjoint derivations as part of the 18.337 Parallel Computing and Scientific Machine Learning graduate course at MIT. And there are entire organizations like my SciML Open Source Software Organization which work day-in and day-out on the development of new differentiable solvers.\nI’ll give a brief summary of all my materials here below.\nContinuous vs Discrete Differentiation of Solvers\nAD of a solver can be done in essentially two different ways: either directly performing automatic  ... READ MORE\nThe post Direct Automatic Differentiation of (Differential Equation) Solvers vs Analytical Adjoints: Which is Better? appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/direct-automatic-differentiation-of-solvers-vs-analytical-adjoints-which-is-better/",
          "publishedOn": "2022-10-11T07:09:53.000Z",
          "wordCount": 3134,
          "title": "Direct Automatic Differentiation of (Differential Equation) Solvers vs Analytical Adjoints: Which is Better?",
          "imageUrl": "http://www.stochasticlifestyle.com/wp-content/uploads/2022/10/Capture7.png"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1670",
          "author": "Christopher Rackauckas",
          "description": "Is differentiable programming actually necessary, or can you just train the neural network in isolation against data and then stick the trained neural network into the simulation? We looked at this problem in detail in our new manuscript titled Capturing missing physics in climate model parameterizations using neural differential equations.\nThe goal of this project is to understand temperature mixing in large eddy simulations, essentially columns of water in the ocean. I.e., can we take a “true” 3D Navier-Stokes and use that to build very quick and accurate models for how heat flows up and down in the water?\n\nThis isn’t a new problem: climate scientists  ... READ MORE\nThe post Is Differentiable Programming Actually Necessary? Can’t you just train the neural networks separately? appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/is-differentiable-programming-actually-necessary-cant-you-just-train-separately/",
          "publishedOn": "2022-10-04T07:38:56.000Z",
          "wordCount": 1510,
          "title": "Is Differentiable Programming Actually Necessary? Can’t you just train the neural networks separately?",
          "imageUrl": "http://www.stochasticlifestyle.com/wp-content/uploads/2022/10/Screenshot-2022-10-03-192913.png"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1659",
          "author": "Christopher Rackauckas",
          "description": "Abstract: Scientific machine learning (SciML) methods allow for the automatic discovery of mechanistic models by infusing neural network training into the simulation process. In this talk we will start by showcasing some of the ways that SciML is being used, from discovery of extrapolatory epidemic models to nonlinear mixed effects models in pharmacology. From there, we will discuss some of the increasingly advanced computational techniques behind the training process, focusing on the numerical issues involved in handling differentiation of highly stiff and chaotic systems. The viewers will leave with an understanding of how compiler techniques are being infused into the simulation stack to increasingly automate the process of developing mechanistic models\nBio: Dr. Chris Rackauckas is the Director of Scientific Research at Pumas-AI, the Director of  ... READ MORE\nThe post Accurate and Efficient Physics-Informed Learning Through Differentiable Simulation (ASA Seminar Talk) appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/accurate-and-efficient-physics-informed-learning-through-differentiable-simulation-asa-seminar-talk/",
          "publishedOn": "2022-07-14T09:58:09.000Z",
          "wordCount": 1317,
          "title": "Accurate and Efficient Physics-Informed Learning Through Differentiable Simulation (ASA Seminar Talk)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1655",
          "author": "Christopher Rackauckas",
          "description": "Keynote Address: New Horizons in Modeling and Simulation in Julia\nPresenters: Viral Shah (Julia Computing, CEO and Co-Founder), Chris Rackauckas (Julia Computing, Director of Modeling and Simulation and Christopher Laughman (Mitsubishi Electric Research Laboratories, Principal Member Research Staff)\nAbstract: As modeling has become more ubiquitous, our models keep growing. The time to build models, verify their behavior, and simulate them is increasing exponentially as we seek more precise predictions. How will our tools change to accommodate the future? Julia’s language design has led to new opportunities. The combination of multiple dispatch, staged compilation, and Julia’s composable libraries have made it possible to build a next generation symbolic-numeric framework. Julia’s abstract interpretation framework enables capabilities such as automatic differentiation, automatic surrogate generation, symbolic tracing, uncertainty propagation, and automatic  ... READ MORE\nThe post Keynote: New Horizons in Modeling and Simulation with Julia (Modelica Conference 2021) appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/keynote-new-horizons-in-modeling-and-simulation-with-julia-modelica-conference-2021/",
          "publishedOn": "2022-06-25T18:11:28.000Z",
          "wordCount": 1221,
          "title": "Keynote: New Horizons in Modeling and Simulation with Julia (Modelica Conference 2021)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        }
      ]
    },
    {
      "title": "Andrej Karpathy blog",
      "feedUrl": "http://karpathy.github.io/feed.xml",
      "siteUrl": "http://karpathy.github.io/",
      "articles": []
    },
    {
      "title": "Mosè Giordano",
      "feedUrl": "https://giordano.github.io/blog/feed.xml",
      "siteUrl": "http://giordano.github.io",
      "articles": [
        {
          "id": "http://giordano.github.io/blog/2022-06-18-first-macro/",
          "author": null,
          "description": "This post isn’t about the first macro I wrote in the Julia programming language, but it can be about your first macro. Frequently Asked Questions Question: What are macros in Julia? Answer: Macros are sort of functions which take as input unevaluated expressions (Expr) and return as output another expression,...",
          "link": "http://giordano.github.io/blog/2022-06-18-first-macro/",
          "publishedOn": "2022-06-17T23:00:00.000Z",
          "wordCount": 3067,
          "title": "My first macro in Julia",
          "imageUrl": "http://giordano.github.io/img/avatar.jpeg"
        }
      ]
    },
    {
      "title": "Shuhei Kadowaki&#39;s homepage",
      "feedUrl": "https://aviatesk.github.io/feed.xml",
      "siteUrl": "https://aviatesk.github.io/",
      "articles": [
        {
          "id": "https://aviatesk.github.io/posts/effects-analysis/index.html",
          "author": null,
          "description": "Quick intro to the new effect analysis of Julia compiler",
          "link": "https://aviatesk.github.io/posts/effects-analysis/index.html",
          "publishedOn": "2022-07-24T00:00:00.000Z",
          "wordCount": 2444,
          "title": "Quick intro to the new effect analysis of Julia compiler",
          "imageUrl": "assets/what_about_the_dead_fish.jpeg"
        }
      ]
    },
    {
      "title": "Mike Innes’s Blog",
      "feedUrl": "https://mikeinnes.io/feed.xml",
      "siteUrl": "/",
      "articles": [
        {
          "id": "https://mikeinnes.io/2022/06/29/clocktower.html",
          "author": null,
          "description": "Three years and two months after it launched on Kickstarter, copies of social deduction game Blood on the Clocktower are finally arriving in the UK. During the long wait eager players have been able to backstab each other using print-and-play copies and the online helper (particularly welcome during lockdowns). But it’s nice to have the real thing in our hands. I’m here to commemorate the occassion with statistics, and in particular to show the ranking system I’m using to see how well my players are doing – just for fun, of course.",
          "link": "https://mikeinnes.io/2022/06/29/clocktower.html",
          "publishedOn": "2022-06-29T00:00:00.000Z",
          "wordCount": 1434,
          "title": "Clocktower IQ",
          "imageUrl": null
        },
        {
          "id": "https://mikeinnes.io/2022/06/24/swap.html",
          "author": null,
          "description": "I just put up a draft paper with a proposal for mixing imperative and functional styles of programming. The gist of it is that we can write code like this:",
          "link": "https://mikeinnes.io/2022/06/24/swap.html",
          "publishedOn": "2022-06-24T00:00:00.000Z",
          "wordCount": 330,
          "title": "Imperative Syntax, Functional Semantics",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Tom Kwong's Infinite Loop",
      "feedUrl": "https://ahsmart.com/feed.xml",
      "siteUrl": "https://ahsmart.com/",
      "articles": []
    },
    {
      "title": "JuliaLang - The Julia programming language",
      "feedUrl": "https://julialang.org/feed.xml",
      "siteUrl": "https://julialang.org/",
      "articles": [
        {
          "id": "https://julialang.org/blog/2022/08/julia-1.8-highlights/",
          "author": null,
          "description": "Highlights of the Julia 1.8 release.\nRead more",
          "link": "https://julialang.org/blog/2022/08/julia-1.8-highlights/",
          "publishedOn": "2022-08-18T00:00:00.000Z",
          "wordCount": 2763,
          "title": "Julia 1.8 Highlights",
          "imageUrl": "/assets/images/julia-open-graph.png"
        },
        {
          "id": "https://julialang.org/blog/2022/08/juliacon-highlights-2022/",
          "author": null,
          "description": "JuliaCon 2022 Highlights\nRead more",
          "link": "https://julialang.org/blog/2022/08/juliacon-highlights-2022/",
          "publishedOn": "2022-08-10T00:00:00.000Z",
          "wordCount": 1104,
          "title": "JuliaCon 2022 Highlights",
          "imageUrl": "https://user-images.githubusercontent.com/35577566/183544010-09691b83-9fc6-4b49-b835-d9a8e691e112.png"
        },
        {
          "id": "https://julialang.org/blog/2022/04/simple-chains/",
          "author": null,
          "description": "Doing small network scientific machine learning in Julia 5x faster than PyTorch ...\nRead more",
          "link": "https://julialang.org/blog/2022/04/simple-chains/",
          "publishedOn": "2022-04-14T00:00:00.000Z",
          "wordCount": 4650,
          "title": "Doing small network scientific machine learning in Julia 5x faster than PyTorch",
          "imageUrl": "/assets/images/julia-open-graph.png"
        }
      ]
    },
    {
      "title": "Ted Kaminski",
      "feedUrl": "https://www.tedinski.com/feed.xml",
      "siteUrl": "http://www.tedinski.com/",
      "articles": []
    },
    {
      "title": "Invenia Blog",
      "feedUrl": "https://invenia.github.io/blog/feed.xml",
      "siteUrl": "https://invenia.github.io/blog/",
      "articles": [
        {
          "id": "https://invenia.github.io/blog/2022/06/17/deprecating-in-julia/",
          "author": null,
          "description": "In software development, the term “deprecated” refers to functionality that is still usable, but is obsolete and about to be replaced or removed in a future version of the software. This blog post will explain why deprecating functionality is a good idea, and will discuss available mechanisms for deprecating functionality in the Julia language.",
          "link": "https://invenia.github.io/blog/2022/06/17/deprecating-in-julia/",
          "publishedOn": "2022-06-17T00:00:00.000Z",
          "wordCount": 1440,
          "title": "Deprecating in Julia",
          "imageUrl": "https://invenia.github.io/blog/public/InveniaLogo.png"
        }
      ]
    },
    {
      "title": "Two-Bit History",
      "feedUrl": "https://twobithistory.org/feed.xml",
      "siteUrl": "https://twobithistory.org/",
      "articles": []
    },
    {
      "title": "programming (and other) musings",
      "feedUrl": "https://jao.io/blog/rss.xml",
      "siteUrl": "https://jao.io/blog/",
      "articles": [
        {
          "id": "https://jao.io/blog/in-no-particular-order.html",
          "author": null,
          "description": "Interesting bits elsewhere:\n\n\n\nThe influence of Self\n10 quick Mastodon tips\nWriting with LaTeX\nTrying out Mathstodon\nOlder entries\n\n\n\nTags: sundry",
          "link": "https://jao.io/blog/in-no-particular-order.html",
          "publishedOn": "2022-11-21T05:05:00.000Z",
          "wordCount": 61,
          "title": "in no particular order",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/the-cambridge-centenary-ulysess.html",
          "author": null,
          "description": "Physically, this book is obnoxious: huge, wasted margins frame a reproduction\nof the original text that painstakingly tries to look as shabby as it was,\nincluding faded letters and all its typos, and its size and weight border on\nthe unmanageable.  Ah, but the contents is really good: on the one hand\nthere's of course Joyce's text itself (after twenty years since the last time,\nmy English, with the help of the annotations, was closer to be up to the task,\nand enjoy it even when it wasn't), and next to it the essays introducing every\nchapter, which i found (with an exception or two) very informative and,\nsometimes, even illuminating.  I was also delighted to confirm that the\nparallels with Homer's work are a strecht to say the least: i quickly read The\nOdyssey in preparation and found it, again, boring at best and disheartening\nin its depiction of the society of the time (not that Joyce's Dublin was\nwithout its blemishes, but you hopefully get my point).\n\n\n\nSo, just get an electronic version and enjoy!\n\nTags: books",
          "link": "https://jao.io/blog/the-cambridge-centenary-ulysess.html",
          "publishedOn": "2022-10-30T01:50:00.000Z",
          "wordCount": 219,
          "title": "the cambridge centenary ulysess",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/visual-differential-geometry-and-forms.html",
          "author": null,
          "description": "This is a beautiful book.  Crystal-clear and insightful explanations, with the\nright amount of historical background and quite original outlook (without\ngoing overboard).  I can only echo what other quoted reviewers have said: i\nwish i had had this book when i was studying these matters in earnest, i'm\npretty sure i've understood some fine points for the first time only now!  I'd\nalso perhaps make an exception on the last part (or act, as Needham calls\nthem) on differential forms, which feels at times a bit rushed and in need of\nsome editing, and it'd had been wonderful if the manufacture of the book were\nup to its contents: most images and photographs look really, really cheap, and\nthere are more typos than granted, which is a pity (as to other figures,\nthey're decent, although it must be said that Needham is not Penrose, but then\nwho is?).\n\nTags: books",
          "link": "https://jao.io/blog/visual-differential-geometry-and-forms.html",
          "publishedOn": "2022-10-30T00:30:00.000Z",
          "wordCount": 193,
          "title": "visual differential geometry and forms",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/inline-snippets-and-grouping-in-consult-recoll.html",
          "author": null,
          "description": "I've just released a new version of consult-recoll, which implements a couple\nof features that i am really liking, namely, grouping of search results by\nmime type:\n\n\n\n\n\n\n\n\n\nand inline snippets:\n\n\n\n\n\n\n\n\n\nHappy searches!\n\n\n\nTags: emacs programming",
          "link": "https://jao.io/blog/inline-snippets-and-grouping-in-consult-recoll.html",
          "publishedOn": "2022-08-04T17:29:00.000Z",
          "wordCount": 79,
          "title": "inline snippets and grouping in consult-recoll",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/parisian-lives.html",
          "author": null,
          "description": "A very interesting view of how a biographer started her career in the\nseventies, with two heavy-weights, Beckett and de Beauvoir.  Bair calls the\nbook a bio-memoir, and it's indeed quite deserving of a name of its own for\nits genre.  One learns of the struggle it was not only to be a biographer of\nfamous writers still living (and her fascinating relationship with them) but\nalso to be a successful woman in the seventies.  And there are lots of\ninteresting details about her writing process, and its all too human side.\nVery well written all around, it really whets your appetite: i've already\nordered her Beckett bio!\n\nTags: books",
          "link": "https://jao.io/blog/parisian-lives.html",
          "publishedOn": "2022-07-31T03:42:00.000Z",
          "wordCount": 146,
          "title": "parisian lives",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/consult-recoll-with-live-preview.html",
          "author": null,
          "description": "Lately, i've gravitated towards recoll as a unified search engine for all my\nlocal data, including org and text notes, documents in PDF or similar formats,\nHTML files, and local email. As a result, my little consult-recoll package has\ngone up a few notches up in my list.  i've just released version 0.5,\nfeaturing live previews.\n\n\n\n\n\n\n\n\n\n\n\n\nRecoll is a local search engine that knows how to index a wide variety of file\nformats.  It also offers a sophisticated query language, and, for some\ndocument kinds, snippets of the text of the document that actually match your\nquery: that's always been one of my favourite features, and wanted to bring it\nto emacs.\n\n\n\ni found consult's live previews a very nice venue to bring snippets into\nemacs, via a new version of consult-recoll, and there you go, jus…",
          "link": "https://jao.io/blog/consult-recoll-with-live-preview.html",
          "publishedOn": "2022-07-22T18:08:00.000Z",
          "wordCount": 378,
          "title": "consult recoll with live preview",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/klara-and-the-sun.html",
          "author": null,
          "description": "A nicely written (as always with Ishiguro) history of Stevens turned into an\nartificially intelligent being, in a near future reminiscent of Never let me\ngo.  In other words, i found this novel heavily inspired in previous works of\nthe author, which i admittedly find better than this one, but that doesn't\nmean the book doesn't throw at you a bunch of provocative musings or lacks a\ntranquil beauty that makes it absolutely worth reading.\n\nTags: books",
          "link": "https://jao.io/blog/klara-and-the-sun.html",
          "publishedOn": "2022-06-19T17:36:00.000Z",
          "wordCount": 117,
          "title": "klara and the sun",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/simple-note-taking.html",
          "author": null,
          "description": "I was just watching Prot's explanation of his new package denote, a very\nelegant note-taking system with a stress on simplicity and, as the author puts\nit, low-tech requirements.  Now, those are excellent qualities in my book, and\ni think i'd quickly become a denote user if it weren't for the fact that i\nalready have a homegrown set of utilities following a similar philosophy.\nInevitably, they differ in some details, as is to be expected from software\nthat has grown with me, as Prot's with him, during more than a decade, but\nthey are similar in important ways.\n\n\n\nI've had in mind writing a brief note on my notes utilities for a while, so i\nguess this is a good time for it: i can, after showing you mine, point you to\na polished package following a similar philosophy and sidestep any temptat…",
          "link": "https://jao.io/blog/simple-note-taking.html",
          "publishedOn": "2022-06-19T03:36:00.000Z",
          "wordCount": 1312,
          "title": "simple note taking",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/slimmer-emacs-with-kitty.html",
          "author": null,
          "description": "A problem of using Emacs as my operating system is that any otherwise\nminor friction with its interface quickly becomes an irritant, and i\nthus find myself needed a truly smooth emacs-human interaction; or, to\nbe more precise emacs-jao interaction: my must needs are going to be,\nsometimes, triffles to you, and the other way round.\n\n\n\nDuring the last year, a perceived sluggishness in Emacs's X11 display\nperformance, together with a very noticeably increased RAM consumption\nhave become one of those irritants, and i decided that enough is\nenough, and moved (for the time being at least) from exwm to,\nessentially, using xmonad and kitty as my Emacs's display engine.\n\n\n\n\n\n\n\n\n\n\n\nFor several years now, i've been using exwm as my main desktop, and\nbeen quite happy with it.  One of the reasons is th…",
          "link": "https://jao.io/blog/slimmer-emacs-with-kitty.html",
          "publishedOn": "2022-06-08T17:53:00.000Z",
          "wordCount": 1147,
          "title": "slimmer emacs with kitty",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/el-infinito-en-un-junco.html",
          "author": null,
          "description": "If you can read Spanish, i wouldn't miss the opportunity to read this\nbeautfiul essay in the original: Irene Vallejo's prose is clear,\nelegant and very beautiful.  It's a delight (and a relief) to read.\nAnd, if you can't read Spanish but have a translation handy, i\nwouldn't miss the opportunity to read it either, for a very\nentertaining account of the history of ancient books sprinkled with\nlots of interesting (to me, at least!) bits about the Greek and Roman\nworlds.  The book is morever wrapped in a subdued and sober optimism\nthat i've found reinvigorating and sorely needed in these times, when\none often feels like running on empty.  Heartily recommended!\n\nTags: books",
          "link": "https://jao.io/blog/el-infinito-en-un-junco.html",
          "publishedOn": "2022-05-28T23:39:00.000Z",
          "wordCount": 157,
          "title": "el infinito en un junco",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/lets-talk-lisp.html",
          "author": null,
          "description": "I just got a second-hand copy of this classic.  Sometimes, used books\nare more charming than new ones:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTags: books programming",
          "link": "https://jao.io/blog/lets-talk-lisp.html",
          "publishedOn": "2022-04-16T19:41:00.000Z",
          "wordCount": 59,
          "title": "let's talk lisp",
          "imageUrl": null
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}