{
  "sources": [
    {
      "title": "Stochastic Lifestyle",
      "feedUrl": "http://www.stochasticlifestyle.com/feed/",
      "siteUrl": "https://www.stochasticlifestyle.com/",
      "articles": [
        {
          "id": "https://www.stochasticlifestyle.com/?p=1732",
          "author": "Christopher Rackauckas",
          "description": "Machine learning is all about examples. The more data you have, the better it should perform, right? With the rise of ChatGPT and Large Language Models (LLMs) as a code helping tool, it was thus just an assumption that the most popular languages like Python would likely be the best for LLMs. But because of the increased productivity, I tend to use a lot of Julia, a language with  an estimated user-base of around a million programmers. For this reason, people have often asked me how it fairs with ChatGPT, Github Copilot, etc., and so I checked out those pieces and… was stunned. It’s really good. It seemed better than Python actually?\nThe data is in: Julia does well with ChatGPT\nThis question was recently put to the test by a researcher named Alessio Buscemi in A Comparative Study  ... READ MORE\nThe post ChatGPT performs better on Julia than Python (and R) for Large Language Model (LLM) Code Generation. Why? appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/chatgpt-performs-better-on-julia-than-python-and-r-for-large-language-model-llm-code-generation-why/",
          "publishedOn": "2023-11-19T15:57:36.000Z",
          "wordCount": 3156,
          "title": "ChatGPT performs better on Julia than Python (and R) for Large Language Model (LLM) Code Generation. Why?",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1729",
          "author": "Christopher Rackauckas",
          "description": "I’m pleased to share a talk I gave in the DDPS seminar series!\n\nData-driven Physical Simulations (DDPS) Seminar Series\nAbstract: The combination of scientific models into deep learning structures, commonly referred to as scientific machine learning (SciML), has made great strides in the last few years in incorporating models such as ODEs and PDEs into deep learning through differentiable simulation. However, the vast space of scientific simulation also includes models like jump diffusions, agent-based models, and more. Is SciML constrained to the simple continuous cases or is there a way to generalize to more advanced model forms? This talk will dive into the mathematical aspects of generalizing differentiable simulation to discuss cases like chaotic simulations, differentiating stochastic simulations like particle filters and agent-based models, and solving  ... READ MORE\nThe post DDPS Seminar Talk: Generalizing Scientific Machine Learning and Differentiable Simulation Beyond Continuous models appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/ddps-seminar-talk-generalizing-scientific-machine-learning-and-differentiable-simulation-beyond-continuous-models/",
          "publishedOn": "2023-11-12T11:54:03.000Z",
          "wordCount": 1576,
          "title": "DDPS Seminar Talk: Generalizing Scientific Machine Learning and Differentiable Simulation Beyond Continuous models",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1723",
          "author": "Christopher Rackauckas",
          "description": "This is a repost of my response on the Julia Discourse on this topic. I was asked to make a blog post so here you go!\nThe “Main” Plotting Packages\nHere’s a quick summary of the most widely used plotting packages. I may have missed one, but I haven’t missed one that is very widely used.\nPlots.jl is the most used. It’s probably the most documented, used in the most tutorials, and is used in many videos.\n\nPros: Its main draw is that it has a lot of plugins to other packages through its recipes system, which means that a lot of odd things like `plot(sol::ODESolution)` or showing the sparsity of a `BandedMatrix` just works. With all of these integrations, it’s normally what I would recommend first to newcomers since they will generally get the most done with the least work. It  ... READ MORE\nThe post Summary of Julia Plotting Packages appeared first on Stochastic Lifestyle.",
          "link": "http://www.stochasticlifestyle.com/summary-of-julia-plotting-packages/",
          "publishedOn": "2023-06-17T14:23:29.000Z",
          "wordCount": 2487,
          "title": "Summary of Julia Plotting Packages",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        }
      ]
    },
    {
      "title": "Andrej Karpathy blog",
      "feedUrl": "http://karpathy.github.io/feed.xml",
      "siteUrl": "http://karpathy.github.io/",
      "articles": []
    },
    {
      "title": "Mosè Giordano",
      "feedUrl": "https://giordano.github.io/blog/feed.xml",
      "siteUrl": "http://giordano.github.io",
      "articles": []
    },
    {
      "title": "Shuhei Kadowaki&#39;s homepage",
      "feedUrl": "https://aviatesk.github.io/feed.xml",
      "siteUrl": "https://aviatesk.github.io/",
      "articles": []
    },
    {
      "title": "Mike Innes’s Blog",
      "feedUrl": "https://mikeinnes.io/feed.xml",
      "siteUrl": "/",
      "articles": [
        {
          "id": "https://mikeinnes.io/2023/06/06/mojo.html",
          "author": null,
          "description": "Last month a startup called Modular released a new language called Mojo (not to be confused with the existing indigenous one). Based on Python and designed for ML hardware and models, Mojo’s goals (“the usability of Python with the performance of C”) coincide with those of the Julia language, so I’m interested to compare notes.[^1]",
          "link": "https://mikeinnes.io/2023/06/06/mojo.html",
          "publishedOn": "2023-06-06T00:00:00.000Z",
          "wordCount": 2202,
          "title": "Finding Your Mojo",
          "imageUrl": null
        },
        {
          "id": "https://mikeinnes.io/2023/05/30/data.html",
          "author": null,
          "description": "Most programming languages conflate the building of data structures and the modelling of information.",
          "link": "https://mikeinnes.io/2023/05/30/data.html",
          "publishedOn": "2023-05-30T00:00:00.000Z",
          "wordCount": 570,
          "title": "Data Structures, Data Modelling",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Tom Kwong's Infinite Loop",
      "feedUrl": "https://ahsmart.com/feed.xml",
      "siteUrl": "https://ahsmart.com/",
      "articles": []
    },
    {
      "title": "JuliaLang - The Julia programming language",
      "feedUrl": "https://julialang.org/feed.xml",
      "siteUrl": "https://julialang.org/",
      "articles": [
        {
          "id": "https://julialang.org/blog/2023/12/julia-1.10-highlights/",
          "author": null,
          "description": "Highlights of the Julia 1.10 release.\nRead more",
          "link": "https://julialang.org/blog/2023/12/julia-1.10-highlights/",
          "publishedOn": "2023-12-27T00:00:00.000Z",
          "wordCount": 2153,
          "title": "Julia 1.10 Highlights",
          "imageUrl": "/assets/images/julia-open-graph.png"
        },
        {
          "id": "https://julialang.org/blog/2023/07/PSA-dont-use-threadid/",
          "author": null,
          "description": "PSA: Thread-local state is no longer recommended; Common misconceptions about threadid() and nthreads()\nRead more",
          "link": "https://julialang.org/blog/2023/07/PSA-dont-use-threadid/",
          "publishedOn": "2023-07-06T00:00:00.000Z",
          "wordCount": 2269,
          "title": "PSA: Thread-local state is no longer recommended",
          "imageUrl": "/assets/images/julia-open-graph.png"
        },
        {
          "id": "https://julialang.org/blog/2023/04/julia-1.9-highlights/",
          "author": null,
          "description": "Highlights of the Julia 1.9 release.\nRead more",
          "link": "https://julialang.org/blog/2023/04/julia-1.9-highlights/",
          "publishedOn": "2023-05-19T00:00:00.000Z",
          "wordCount": 3760,
          "title": "Julia 1.9 Highlights",
          "imageUrl": "/assets/images/julia-open-graph.png"
        }
      ]
    },
    {
      "title": "Ted Kaminski",
      "feedUrl": "https://www.tedinski.com/feed.xml",
      "siteUrl": "http://www.tedinski.com/",
      "articles": []
    },
    {
      "title": "Invenia Blog",
      "feedUrl": "https://invenia.github.io/blog/feed.xml",
      "siteUrl": "https://invenia.github.io/blog/",
      "articles": []
    },
    {
      "title": "Two-Bit History",
      "feedUrl": "https://twobithistory.org/feed.xml",
      "siteUrl": "https://twobithistory.org/",
      "articles": []
    },
    {
      "title": "programming (and other) musings",
      "feedUrl": "https://jao.io/blog/rss.xml",
      "siteUrl": "https://jao.io/blog/",
      "articles": [
        {
          "id": "https://jao.io/blog/poor-things.html",
          "author": null,
          "description": "I've read good things about the forthcoming movie, and liked what I saw in the\npromotional video, but I cannot believe it's going to be near as good as this\nnovel. The book has too many nuances, literary tricks and wordplay and\nparagraphs one has to read and reread, to be translated to a film. The latter\nmight be its own work of art, and that's fine. But if you're curious about the\nmovie, I'd definitely recommend to read this book. If you're not, I'd\ndefinitely recommend to read this book. The writing is fresh and funny, in\ntypical Gray fashion, and the real themes of the book are universal and\nexposed in a way that is very entertaining on the surface, but with a subtext\nthat gives you food for thought. I don't remember when was the last time that\nI read two hundred pages of a book in a single day, time just flew, as they\nsay.\n\nTags: books",
          "link": "https://jao.io/blog/poor-things.html",
          "publishedOn": "2023-10-11T01:28:00.000Z",
          "wordCount": 197,
          "title": "poor things",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/in-no-particular-order.html",
          "author": null,
          "description": "Interesting bits elsewhere:\n\n\n\nTimeless Advice on Writing: The Collected Wisdom of Great Writers\nLeaving Haskell behind — Infinite Negative Utility\nKnuth: Ancient Babylonian Algorithms annotated/explained version.\nMastering Bloom Filters: Big Data Processing in Python\nOlder entries\n\n\n\nTags: sundry",
          "link": "https://jao.io/blog/in-no-particular-order.html",
          "publishedOn": "2023-10-11T01:00:00.000Z",
          "wordCount": 78,
          "title": "in no particular order",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "wingolog",
      "feedUrl": "https://wingolog.org/feed/atom",
      "siteUrl": "https://wingolog.org/",
      "articles": [
        {
          "id": "https://wingolog.org/archives/2023/12/14/service-update",
          "author": null,
          "description": "Late last year I switched blog entries and comments to be written in , but there was a bug that I never noticed: if a text consisted only of a single paragraph or block, it would trigger an error that got reported back to the user in a very strange way, and which would prevent the comment from being posted.a dialect of markdown\nI had never seen the error myself because blog posts are generally more than a paragraph, but it must have been quite irritating when commenting.  Sorry about that; it should be fixed now.  Should you experience more strange errors, please do send me an email with the comment to .  Cheers.wingo@igalia.com",
          "link": "https://wingolog.org/archives/2023/12/14/service-update",
          "publishedOn": "2023-12-14T14:28:45.000Z",
          "wordCount": 898,
          "title": "service update",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/12/sir-talks-a-lot",
          "author": null,
          "description": "I know, dear reader: of course you have already seen all my talks this year.  Your attentions are really too kind and I thank you.  But those other people, maybe you share one talk with them, and then they ask you for more, and you have to go stalking back through the archives to slake their nerd-thirst.  This happens all the time, right?\nI was thinking of you this morning and I said to myself, why don’t I put together a post linking to all of my talks in 2023, so that you can just send them a link; here we are.  You are very welcome, it is really my pleasure.\n  Wasm\nstandards group, Munich, 11 Oct 2023.\nScheme + Wasm + GC = MVP: Hoot Scheme-to-Wasm compiler update.slides\n\nWasm GC subgroup, 18 Apr 2023.\nScheme to Wasm: Use and misuse of the GC proposal.slides\n\nBOB, Berlin, 17 Mar 2023.\n\n\nA world to win: WebAssembly for the rest of us.blogslidesyoutube\n\nEOSS, Prague, 27 June 2023.\n\n\n\n\n\n\n\nCross-platform mobile UI: “Compilers, compilers everywhere”.slidesyoutubeblogblogblogblogblogblog\n\nSpritely, remote, 10 May 2023.\n\nCPS Soup: A functional intermediate language.blogslides\n\nFOSDEM, Brussels, 4 Feb 2023.\n\n\nWhippet: A new GC for Guile.blogeventslides\nStill here?  The full  will surely fill your cup.talks archive\n2023 talks\nbut wait, there’s more",
          "link": "https://wingolog.org/archives/2023/12/12/sir-talks-a-lot",
          "publishedOn": "2023-12-12T15:18:14.000Z",
          "wordCount": 1131,
          "title": "sir talks-a-lot",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/10/a-simple-hdr-histogram",
          "author": null,
          "description": "Good evening!  This evening, a note on high-dynamic-range (HDR)\nhistograms.\nHow should one record garbage collector pause times?\nA few options present themselves: you could just record the total pause\ntime.  Or, also record the total number of collections, which allows you\nto compute the average.  Maximum is easy enough, too.  But then you\nmight also want the median or the p90 or the p99, and these percentile\nvalues are more gnarly: you either need to record all the pause times,\nwhich can itself become a memory leak, or you need to approximate via a\nhistogram.\nLet’s assume that you decide on the histogram approach.  How should you\ncompute the bins?  It would be nice to have microsecond accuracy on the\nsmall end, but if you bin by microsecond you could end up having\nmillions of bins, which …",
          "link": "https://wingolog.org/archives/2023/12/10/a-simple-hdr-histogram",
          "publishedOn": "2023-12-10T21:27:59.000Z",
          "wordCount": 1838,
          "title": "a simple hdr histogram",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/08/v8s-mark-sweep-nursery",
          "author": null,
          "description": "Today, a followup to  with some more details on V8’s new\nyoung-generation implementation,  or .yesterday’s noteminor mark-sweepMinorMS\nA\ncaveat again: these observations are just from reading the code; I\nhaven’t run these past the MinorMS authors yet, so any of these details\nmight be misunderstandings.\nThe MinorMS nursery consists of , each of which is 256 kB, unless\nhuge-page mode is on, in which case they are 2 MB.  The total default\nsize of the nursery is 72 MB by default, or 144 MB if  is off.pagespointer\ncompression\nThere can be multiple threads allocating into the nursery, but let’s\nfocus on the ,\nwhich is used on the main thread.  Nursery allocation is bump-pointer,\nwhether in a MinorMS page or scavenger semi-space.  Bump-pointer regions\nare called , and often abbreviated as \nin the…",
          "link": "https://wingolog.org/archives/2023/12/08/v8s-mark-sweep-nursery",
          "publishedOn": "2023-12-08T14:34:03.000Z",
          "wordCount": 1476,
          "title": "v8's mark-sweep nursery",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/07/the-last-5-years-of-v8s-garbage-collector",
          "author": null,
          "description": "Captain, status report: I’m down here in a Jeffries tube, poking at V8’s\ngarbage collector.  However, despite working on other areas of the project\nrecently, V8 is now so large that it’s necessary to ignore whole subsystems when working on any given task.  But now I’m looking at the GC in anger: what is its deal?  What does V8’s GC even look like these days?\nThe  was in 2019; fine enough, but\ndated.  Now in the evening of 2023 I think it could be useful to revisit\nit and try to summarize the changes since then.  At least, it would have\nbeen useful to me had someone else written this article.last public article on the structure of V8’s garbage\ncollector\nTo my mind, work on V8’s GC has had three main goals over the last 5\nyears: improving interactions between the managed heap and C++,\nimprov…",
          "link": "https://wingolog.org/archives/2023/12/07/the-last-5-years-of-v8s-garbage-collector",
          "publishedOn": "2023-12-07T12:15:45.000Z",
          "wordCount": 2068,
          "title": "the last 5 years of V8's garbage collector",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/05/colophonwards",
          "author": null,
          "description": "A brief meta-note this morning: for the first time in 20 years, I\nfinally got around to updating the web design of\n recently and wanted to share a bit\nabout that.wingolog.org\nBack when I made ,\nI was using the then-brand-new Wordpress,  was the most common web browser, CSS wasn’t very good, the Safari browser had\njust made its first release, smartphones were yet to be invented, and\neveryone used low-resolution CRT screens.  The original design did use CSS instead\nof tables, thankfully, but it was very narrow and left a lot up to the\nuser agent (notably font choice and size).the initial wingolog\ndesignInternet Explorer\n6\nThese days you can do much better.  Even HTML has moved on, with\n\nand\n\nand\n\nelements.  CSS is powerful and interoperable, with grid layout and\nmedia queries and  and  and a…",
          "link": "https://wingolog.org/archives/2023/12/05/colophonwards",
          "publishedOn": "2023-12-05T11:36:57.000Z",
          "wordCount": 1534,
          "title": "colophonwards",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/11/24/tree-shaking-the-horticulturally-misguided-algorithm",
          "author": null,
          "description": "Let’s talk about tree-shaking!\nBut first, I need to talk about WebAssembly’s dirty secret: despite the\nhype, WebAssembly has had limited success on the web.\nThere is\n,\nwhich does appear to be a real success.  5 years ago there was\n, though they don’t\ntalk much about Wasm these days.  There are quite a number of little NPM\nlibraries that use Wasm under the hood, usually compiled from C++ or\nRust.  I think\n\nprobably gets used for a few in-house corporate apps, though I could be\nfooled by their marketing.PhotoshopFigmaBlazor\nYou might recall the hyped demos of 3D first-person-shooter\ngames with Unreal engine again from 5 years ago, but that was the previous major release of\nUnreal and was always experimental; the current Unreal 5 does not support targetting\nWebAssembly.\nDon’t get me wrong, I …",
          "link": "https://wingolog.org/archives/2023/11/24/tree-shaking-the-horticulturally-misguided-algorithm",
          "publishedOn": "2023-11-24T11:41:37.000Z",
          "wordCount": 2855,
          "title": "tree-shaking, the horticulturally misguided algorithm",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/11/16/a-whiff-of-whiffle",
          "author": null,
          "description": "A couple nights ago I \nand promised to move on from sheepishly justifying my egregious behavior in\nmy next note, and finally mention some results from this experiment.\nWell, no: I am back on my bullshit.  Tonight I write about a couple of\nimplementation details that discerning readers may find of interest:\nvalue representation, the tail call issue, and the standard library.wrote about a superfluous Scheme\nimplementation\nAs a Lisp, Scheme is one of the early “dynamically typed” languages.\nThese days when you say “type”, people immediately think ,\nmechanized proof of program properties, and so on.  But “type”\nhas another denotation which is all about values and almost not at all\nabout terms: one might say that\n has a type, but\nit’s not part of a proof; it’s just that if you try to  a\npair in…",
          "link": "https://wingolog.org/archives/2023/11/16/a-whiff-of-whiffle",
          "publishedOn": "2023-11-16T21:11:43.000Z",
          "wordCount": 1661,
          "title": "a whiff of whiffle",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/11/14/whiffle-a-purpose-built-scheme",
          "author": null,
          "description": "Yesterday I \nbut didn’t actually get past the admission of guilt.  Today the\ndefendant takes the stand, in the hope that an awkward\ncross-examination will persuade the jury to take pity on a poor\nmisguided soul.promised an\napology\nWhich is to say, let’s talk about\n: what it actually is, what it is\ndoing for me, and why on earth it is that [I tell myself that] writing a\nnew programming language implementation is somehow preferable than\nre-using an existing one.Whiffle\nWhiffle is purpose-built to test the\n garbage collection library.Whippet\nWhiffle lets me create Whippet test cases in C, without actually writing\nC.  C is fine and all, but the problem with it and garbage collection is\nthat you have to track all stack roots manually, and this is an\nerror-prone process.  Generating C means that…",
          "link": "https://wingolog.org/archives/2023/11/14/whiffle-a-purpose-built-scheme",
          "publishedOn": "2023-11-14T22:10:58.000Z",
          "wordCount": 1566,
          "title": "whiffle, a purpose-built scheme",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/11/13/i-accidentally-a-scheme",
          "author": null,
          "description": "Good evening, dear hackfriends.  Tonight’s missive is an apology: not\nquite in the sense of expiation, though not quite\n that, either; rather, apology in the sense of explanation, of\nexegesis: apologia.  See, I accidentally made a Scheme.  I know I have\nenough Scheme implementations already, but I went and made another one.\nIt’s for a maybe good reason, though!not\nI feel like we should make this the decade of leaning into your problems,\nand I have a Scheme problem, so here we are.  See, I co-maintain\n, and have been noodling on a new\ngarbage collector (GC) for Guile,\n.  Whippet is designed to be\nembedded in the project that uses it, so one day I hope it will be just\ncopied into Guile’s source tree, replacing the venerable\n that we currently use.GuileWhippetBDW-GC\nThe thing is, though, that…",
          "link": "https://wingolog.org/archives/2023/11/13/i-accidentally-a-scheme",
          "publishedOn": "2023-11-13T21:36:08.000Z",
          "wordCount": 1427,
          "title": "i accidentally a scheme",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Planet Lisp",
      "feedUrl": "http://planet.lisp.org/rss20.xml",
      "siteUrl": "http://planet.lisp.org/",
      "articles": [
        {
          "id": "https://journal.paoloamoroso.com/my-common-lisp-setup-on-linux?pk_campaign=rss-feed",
          "author": null,
          "description": "Now that I'm back to Lisp I'm actively exploring Interlisp as a Common Lisp environment too.\nBut to code in Common Lisp also on my Crostini Linux system, the Linux container of chromeOS I use on a Chromebox, I'm setting up a suitable development environment. In addition to console programs I want to write GUI applications with McCLIM.\nThe Common Lisp implementation I chose, SBCL, is a no brainer given its features, performance, and active maintenance. As for the development environment I won't go with the default on Linux, Emacs. Although I used Emacs for years and loved it, now it feels overkill and I'd prefer not to re-learn its intricacies.\nInstead I'm using Lem, a great Emacs-like IDE written in Common Lisp with a user interface and keybindings similar to those of Emacs and SLIME. Thus my familiarity with Emacs is enough to get me up to speed. A nice side effect of Lem's implementation language is the IDE can be configured and extended in Common Lisp, which I feel more at home with than Emacs Lisp.\nDespite some initial installation issues Lem works well on Crostini, is fast, and has a nice SDL2 backend. I really like the IDE.\nIf I need to write or run some Common Lisp code on my Raspberry Pi 400 I can easily replicate this setup there.\n#CommonLisp #Lisp\nDiscuss...\nEmail | Reply @amoroso@fosstodon.org",
          "link": "https://journal.paoloamoroso.com/my-common-lisp-setup-on-linux?pk_campaign=rss-feed",
          "publishedOn": "2023-12-27T13:30:34.000Z",
          "wordCount": 741,
          "title": "Paolo Amoroso: My Common Lisp setup on Linux",
          "imageUrl": "https://i.snap.as/68i8povn.jpg"
        },
        {
          "id": "https://lisp-journey.gitlab.io/blog/latest-string-manipulation-functions/",
          "author": null,
          "description": "We just released cl-str\nv0.21. It’s\nbeen a while since the last release, and many enhancements make it\nmore useful than ever. Let’s review the changes, the newest first.\nBut first, I want to you thank everyone who contributed, by sending\npull requests or feedback. Special thanks to\n@kilianmh who suddenly appeared one\nday, helped with new features as well as grunt work, and who is now a\nco-maintainer.\nsplit by regex\nThe latest addition sent by ccQpein is that str:split now accepts a :regex key argument to split by regular expressions. The functions rsplit and split-omit-nulls have it too.\n(str:split \"[,|;]\" \"foo,bar;baz\" :regex t)\n;; => (\"foo\" \"bar\" \"baz\")\n\nThat’s handy for advent of code ;)\nYou can also use ppcre:split, this is the function that str:split\nrelies on anyways, except that by …",
          "link": "https://lisp-journey.gitlab.io/blog/latest-string-manipulation-functions/",
          "publishedOn": "2023-12-22T15:52:51.000Z",
          "wordCount": 1393,
          "title": "vindarel: Latest string manipulation functions in the STR library",
          "imageUrl": "/images/default.png"
        },
        {
          "id": "https://reader.tymoon.eu/article/433",
          "author": null,
          "description": "I've been writing libraries for Common Lisp for over a decade now (lord almighty), and for most of that time I've tried to ensure that the libraries would, in the very least, work on all three major operating systems: Windows, Linux, and MacOS.\nUsually doing so isn't hard, as I can rely on the implementation and the language standard, but especially for libraries that deal with foreign code or operating system interfaces, a bit more work is needed. For the longest time I went the extra mile of providing that support myself, despite not being a MacOS user, and despite vehemently disapproving of Apple as a company and their treatment of users and developers.\nAbout two years ago, I stopped. I had had enough of all the extra work the platform put on me, for zero personal gain. Especially I had…",
          "link": "https://reader.tymoon.eu/article/433",
          "publishedOn": "2023-11-27T14:04:32.000Z",
          "wordCount": 412,
          "title": "Yukari Hafner: The State of MacOS Support",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2517"
        },
        {
          "id": "http://funcall.blogspot.com/2023/11/github-co-pilot-review.html",
          "author": null,
          "description": "I recently tried out GitHub CoPilot.  It is a system that uses\n  generative AI to help you write code.\nThe tool interfaces to your IDE — I used VSCode — and\n  acts as an autocomplete on steroids … or acid.  Suggested\n  comments and code appear as you move the cursor and you can often choose from\n  a couple of different completions.  The way to get it to write code was to\n  simply document what you wanted it to write in a comment.  (There is\n  a chat interface where you can give it more directions, but I did\n  not play with that.)\nI decided to give it my standard interview question: write a simple\n  TicTacToe class, include a method to detect a winner.  The tool spit\n  out a method that checked an array for three in a row horizontally,\n  vertically, and along the two diagonals.  Almost corr…",
          "link": "http://funcall.blogspot.com/2023/11/github-co-pilot-review.html",
          "publishedOn": "2023-11-24T15:50:00.000Z",
          "wordCount": 4472,
          "title": "Joe Marshall: GitHub Co-pilot Review",
          "imageUrl": null
        },
        {
          "id": "https://www.n16f.net/blog/interactive-common-lisp-development/",
          "author": null,
          "description": "Common Lisp programming is often presented as “interactive”. In most\nlanguages, modifications to your program are applied by recompiling it and\nrestarting it. In contrast, Common Lisp lets you incrementally modify your\nprogram while it is running.\nWhile this approach is convenient, especially for exploratory programming, it\nalso means that the state of your program during execution does not always\nreflect the source code. You do not just define new constructs: you look them\nup, inspect them, modify them or delete them. I had to learn a lot of\nsubtleties the hard way. This article is a compendium of information related\nto the interactive nature of Common Lisp.\nVariables\nIn Common Lisp variables are identified by symbols. Evaluating (SETQ A 42)\ncreates or updates a variable with the integer …",
          "link": "https://www.n16f.net/blog/interactive-common-lisp-development/",
          "publishedOn": "2023-11-19T18:00:00.000Z",
          "wordCount": 2517,
          "title": "Nicolas Martyanoff: Interactive Common Lisp development",
          "imageUrl": null
        },
        {
          "id": "http://blog.quicklisp.org/2023/10/october-2023-quicklisp-dist-update-now.html",
          "author": null,
          "description": "New projects: \n\n3d-math — A library implementing the necessary linear algebra math for 2D and 3D computations — zlib\nansi-test-harness — A testing harness that fetches ansi-test and allows subsets and extrinsic systems — MIT\nbabylon — Jürgen Walther's modular, configurable, hybrid knowledge engineering systems framework for Common Lisp, restored from the CMU AI Repository. — MIT\ncalm — CALM - Canvas Aided Lisp Magic — GNU General Public License, version 2\ncffi-object — A Common Lisp library that enables fast and convenient interoperation with foreign objects. — Apache-2.0\ncffi-ops — A library that helps write concise CFFI-related code. — Apache-2.0\ncl-brewer — Provides CI settings for cl-brewer. — Unlicense\ncl-jwk — Common Lisp system for decoding public JSON Web Keys (JWK) — BSD 2-Clause\n…",
          "link": "http://blog.quicklisp.org/2023/10/october-2023-quicklisp-dist-update-now.html",
          "publishedOn": "2023-10-30T00:46:00.000Z",
          "wordCount": 3398,
          "title": "Quicklisp news: October 2023 Quicklisp dist update now available",
          "imageUrl": null
        },
        {
          "id": "http://blog.funcall.org//lisp/2023/10/23/deptree/",
          "author": null,
          "description": "Deptree is a tool to list and archive dependency snapshots of (ASDF-defined) projects. We at Norphonic use it in the product build pipeline, but it can be useful for integration workflows as well. The task sounds common enough so there's little doubt am reinventing the wheel with this. Alas, I couldn't find any readily available solutions nor good folks at #commonlisp could recall of any, so there.\nAvailable in the latest Quicklisp.",
          "link": "http://blog.funcall.org//lisp/2023/10/23/deptree/",
          "publishedOn": "2023-10-22T15:00:00.000Z",
          "wordCount": 98,
          "title": "Eugene Zaikonnikov: Announcing deptree",
          "imageUrl": null
        },
        {
          "id": "http://blog.funcall.org//lisp/2023/10/22/also-alsa/",
          "author": null,
          "description": "Also ALSA now has a simple ALSA Mixer API support. See set-mixer-element-volume for sample use.\nAvailable in the latest Quicklisp.",
          "link": "http://blog.funcall.org//lisp/2023/10/22/also-alsa/",
          "publishedOn": "2023-10-21T15:00:00.000Z",
          "wordCount": 52,
          "title": "Eugene Zaikonnikov: Also ALSA gets Mixer API",
          "imageUrl": null
        },
        {
          "id": "https://lisp-journey.gitlab.io/blog/common-lisp-on-the-web-enrich-your-stacktrace-with-request-and-session-data/",
          "author": null,
          "description": "A short post to show the usefulness of Hunchentoot-errors and to thank Mariano again.\nThis library adds the current request and session data to your stacktrace, either in the REPL (base case) or in the browser.\nTLDR;\nUse it like this:\n;; (ql:quickload \"hunchentoot-errors)\n;;\n;; We also use easy-routes: (ql:quickload \"easy-routes\")\n\n(defclass acceptor (easy-routes:easy-routes-acceptor hunchentoot-errors:errors-acceptor)\n  ()\n  (:documentation \"Our Hunchentoot acceptor that uses easy-routes and hunchentoot-errors, for easier route definition and enhanced stacktraces with request and session data.\"))\n\nthen (make-instance 'acceptor :port 4242).\nBase case\nImagine you have a bug in your route:\n(easy-routes:defroute route-card-page (\"/card/:slug\" :method :GET :decorators ((@check-roles admin-role…",
          "link": "https://lisp-journey.gitlab.io/blog/common-lisp-on-the-web-enrich-your-stacktrace-with-request-and-session-data/",
          "publishedOn": "2023-10-13T14:51:07.000Z",
          "wordCount": 928,
          "title": "vindarel: Common Lisp on the web: enrich your stacktrace with request and session data",
          "imageUrl": "/images/default.png"
        },
        {
          "id": "http://funcall.blogspot.com/2023/10/syntax-rules-primer.html",
          "author": null,
          "description": "I recently had an inquiry about the copyright status of my JRM’s Syntax Rules Primer for the Merely Eccentric.\nI don’t want to put it into public domain as that would allow anyone to rewrite it at will and leave that title.  Instead, I'd like to release it on an MIT style license: feel free to copy it and distribute it, correct any errors, but please retain the general gist of the article and the title and the authorship.",
          "link": "http://funcall.blogspot.com/2023/10/syntax-rules-primer.html",
          "publishedOn": "2023-10-13T09:17:00.000Z",
          "wordCount": 3597,
          "title": "Joe Marshall: Syntax-rules Primer",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "hyPiRion",
      "feedUrl": "https://hypirion.com/rss/all",
      "siteUrl": "https://hypirion.com",
      "articles": [
        {
          "id": "https://hypirion.com/musings/haunting-down-errors-in-go",
          "author": null,
          "description": "Phantom types won't revolutionise your Go debugging experience, but it can make it slightly better! Here's one way they can help out.",
          "link": "https://hypirion.com/musings/haunting-down-errors-in-go",
          "publishedOn": "2023-08-06T18:43:00.000Z",
          "wordCount": 1202,
          "title": "Haunting Down Errors in Go",
          "imageUrl": "https://hypirion.com/thumbnails/this-is-fine-errnorows.png"
        },
        {
          "id": "https://hypirion.com/musings/go-stly-access-rights",
          "author": null,
          "description": "With phantom types, we can make a static access control system in Go that will detect errors and act as easy-to-read documentation. Here's how you do it.",
          "link": "https://hypirion.com/musings/go-stly-access-rights",
          "publishedOn": "2023-07-23T14:00:00.000Z",
          "wordCount": 2147,
          "title": "Go-stly Access Rights",
          "imageUrl": "https://hypirion.com/thumbnails/screampher.jpg"
        },
        {
          "id": "https://hypirion.com/musings/spectral-contexts-in-go",
          "author": null,
          "description": "Go has phantom types, and we can use them to attach singletons to contexts. Here is a short post on how to do just that.",
          "link": "https://hypirion.com/musings/spectral-contexts-in-go",
          "publishedOn": "2023-06-18T17:00:00.000Z",
          "wordCount": 693,
          "title": "Spectral Contexts in Go",
          "imageUrl": "https://hypirion.com/thumbnails/phantom-types-in-go.jpg"
        },
        {
          "id": "https://hypirion.com/musings/graphql-and-type-systems",
          "author": null,
          "description": "Like Go, GraphQL isn't at the forefront of type theory. Let's look at what I miss and whether it would be sensible to add them to the specification.",
          "link": "https://hypirion.com/musings/graphql-and-type-systems",
          "publishedOn": "2023-05-28T15:45:00.000Z",
          "wordCount": 2151,
          "title": "GraphQL and Type Systems",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "(think)",
      "feedUrl": "https://batsov.com/atom.xml",
      "siteUrl": "https://batsov.com/",
      "articles": [
        {
          "id": "https://batsov.com/articles/2023/12/23/a-bad-year-for-blogging/",
          "author": null,
          "description": "Last year (2022) I celebrated a rather unexpected all time blogging record. As it often happens in such cases, however, there was a massive drop in my blogging activity afterwards.",
          "link": "https://batsov.com/articles/2023/12/23/a-bad-year-for-blogging/",
          "publishedOn": "2023-12-23T06:34:00.000Z",
          "wordCount": 609,
          "title": "A Bad Year for Blogging",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/12/22/fastmail-year-two/",
          "author": null,
          "description": "Here’s a small follow-up to my usage of Fastmail that started in 2021. In a nutshell - little has changed since my previous update. Fastmail is still my favorite email vendor and I keep using it more and more. Here are a few highlights:",
          "link": "https://batsov.com/articles/2023/12/22/fastmail-year-two/",
          "publishedOn": "2023-12-22T14:41:00.000Z",
          "wordCount": 666,
          "title": "Fastmail: Year Two",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/04/20/learning-ocaml-quoted-string-literals/",
          "author": null,
          "description": "While learning OCaml I’ve noticed one curious feature - it has two types of string literals. The first type are the common and quite familiar “double-quoted string literals” (or perhaps simply “string literals”?):",
          "link": "https://batsov.com/articles/2023/04/20/learning-ocaml-quoted-string-literals/",
          "publishedOn": "2023-04-20T13:23:00.000Z",
          "wordCount": 1045,
          "title": "Learning OCaml: Quoted String Literals",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/04/09/updating-the-bundler-version-specified-in-gemfile-lock/",
          "author": null,
          "description": "You might have noticed one change introduced with Bundler 2.3 - it now requires you to run the version of Bundler that’s specified in your Gemfile.lock.1 This means that occasionally you might see something like this: https://bundler.io/blog/2022/01/23/bundler-v2-3.html &#8617;",
          "link": "https://batsov.com/articles/2023/04/09/updating-the-bundler-version-specified-in-gemfile-lock/",
          "publishedOn": "2023-04-09T16:29:00.000Z",
          "wordCount": 477,
          "title": "Updating the Bundler Version Specified in Gemfile.lock",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/04/09/blog-comments-are-back/",
          "author": null,
          "description": "This is going to be one super short post.",
          "link": "https://batsov.com/articles/2023/04/09/blog-comments-are-back/",
          "publishedOn": "2023-04-09T15:57:00.000Z",
          "wordCount": 438,
          "title": "Blog Comments are Back",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/03/20/how-are-ocaml-programmers-called/",
          "author": null,
          "description": "Ruby programmers are commonly called Rubyists. Python programmers are often called Pythonistas. Lisp programmers are widely known as Lispers. Clojure programmers are sometimes called Clojurians.",
          "link": "https://batsov.com/articles/2023/03/20/how-are-ocaml-programmers-called/",
          "publishedOn": "2023-03-20T08:02:00.000Z",
          "wordCount": 598,
          "title": "How are OCaml Programmers Called?",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        }
      ]
    },
    {
      "title": "Lambda/Sierra",
      "feedUrl": "https://www.lambdasierra.com/feed.xml",
      "siteUrl": "https://www.lambdasierra.com/",
      "articles": [
        {
          "id": "urn:uuid:71d51fbc-5910-4253-81fa-56366970fcac",
          "author": null,
          "description": "WordPress.com is offering a 100-year plan. But why?",
          "link": "https://www.lambdasierra.com/2023/100-year-plan/",
          "publishedOn": "2023-11-05T20:00:00.000Z",
          "wordCount": 861,
          "title": "You Bet Your Life",
          "imageUrl": "https://www.lambdasierra.com/2023/100-year-plan/img/100-year-plan.jpg"
        },
        {
          "id": "urn:uuid:a8d0b690-8938-4743-902a-c6978ba7ef0c",
          "author": null,
          "description": "A plea to technical writers: Please stop inventing abbreviations and acronyms without defining them.",
          "link": "https://www.lambdasierra.com/2023/abbreviating/",
          "publishedOn": "2023-06-03T18:30:00.000Z",
          "wordCount": 800,
          "title": "Stop Abbreviating!",
          "imageUrl": "https://www.lambdasierra/2023/img/flowchart.svg"
        },
        {
          "id": "urn:uuid:417d13a1-0e74-48b4-93da-715fbe03736e",
          "author": null,
          "description": "Social media killed comments. What's a lonely blogger to do?",
          "link": "https://www.lambdasierra.com/2023/building/comments",
          "publishedOn": "2023-05-20T20:00:00.000Z",
          "wordCount": 395,
          "title": "One-Way Comments?",
          "imageUrl": "https://www.lambdasierra/2023/building/img/stephen-phillips-hostreviews-co-uk--zRNvl3EUdw-unsplash.jpg"
        },
        {
          "id": "urn:uuid:ba04a467-ff41-43b3-907d-2810c12af8bb",
          "author": null,
          "description": "My experience as a backend programmer trying to write my own CSS by hand",
          "link": "https://www.lambdasierra.com/2023/building/css",
          "publishedOn": "2023-05-16T22:00:00.000Z",
          "wordCount": 537,
          "title": "(Re-)Learning CSS as a Backend Dev",
          "imageUrl": "https://www.lambdasierra.com/2023/building/img/csstoot.png"
        },
        {
          "id": "urn:uuid:f9aaf15d-37c1-4a8e-bab7-9ccd0b60d12c",
          "author": null,
          "description": "On starting a new blog, abandoning the stability of WordPress for the creative freedom of do-it-yourself.",
          "link": "https://www.lambdasierra.com/2023/building/",
          "publishedOn": "2023-04-13T22:00:42.000Z",
          "wordCount": 742,
          "title": "Building Foundations",
          "imageUrl": "https://www.lambdasierra.com/2023/building/img/digitalme.gif"
        },
        {
          "id": "urn:uuid:5960d9ab-f082-4b72-b3a0-7753d56d2008",
          "author": null,
          "description": "AWS API docs from the Cognitect AWS Client library as Emacs Org Mode",
          "link": "https://www.lambdasierra.com/2023/aws-org/",
          "publishedOn": "2023-03-12T22:30:00.000Z",
          "wordCount": 619,
          "title": "AWS API in Org Mode with Clojure",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Squid's Blog",
      "feedUrl": "http://gigasquidsoftware.com/atom.xml",
      "siteUrl": "http://gigasquid.github.io/atom.xml",
      "articles": [
        {
          "id": "http://gigasquid.github.io/blog/2023/07/02/ciphers-with-vector-symbolic-architectures/",
          "author": null,
          "description": "A secret message inside a 10,000 hyperdimensional vector\nWe’ve seen in previous posts how we can encode data structures using Vector Symbolic Architectures in Clojure. This is an exploration of how we can use this to develop a cipher to transmit a secret message between two parties.\nA Hyperdimensional Cipher\nUsually, we would develop a dictionary/ cleanup memory of randomly chosen hyperdimensional vectors to represent each symbol. We could do this, but then sharing the dictionary as our key to be able to decode messages would be big. Instead, we could share a single hyperdimensional vector and then use the protect/ rotation operator to create a dictionary of the alphabet and some numbers to order the letters. Think of this as the initial seed symbol and the rest being defined as n+1.\n\n\n\n1\n…",
          "link": "http://gigasquid.github.io/blog/2023/07/02/ciphers-with-vector-symbolic-architectures/",
          "publishedOn": "2023-07-02T16:31:00.000Z",
          "wordCount": 915,
          "title": "Ciphers With Vector Symbolic Architectures",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Eval / Apply is pure magic",
      "feedUrl": "https://www.evalapply.org/index.xml",
      "siteUrl": "https://www.evalapply.org/",
      "articles": [
        {
          "id": "https://www.evalapply.org/posts/mycelium-clj/",
          "author": null,
          "description": "In a world of concrete objects, steel frameworks bring sense and order. In a forest of composable tools, libraries and open-ended schemas, it would be the mycelia. A frustrated yet optimistic man muses \"Might such a thing come to be?\".",
          "link": "https://www.evalapply.org/posts/mycelium-clj/index.html",
          "publishedOn": "2023-10-19T00:00:00.000Z",
          "wordCount": 1057,
          "title": "Riff: A \"mycelium-clj\" for the Clojure ecosystem?",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-ide-experience/",
          "author": null,
          "description": "The one in which we design a rich Integrated Development Environment (IDE) experience, using Clojure as our muse. Featuring Language Server Protocol (lsp-mode + clojure-lsp), clojure-mode, cider, and more! Buckle up and get a coffee.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-ide-experience/index.html",
          "publishedOn": "2023-09-07T00:00:00.000Z",
          "wordCount": 4579,
          "title": "Emerging from dotemacs bankruptcy the hard way: integrating the IDE (feat. Clojure(Script))",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-getting-about/",
          "author": null,
          "description": "We want to maximize our ability to \"stay in The Zone\". So the aim is to create the fastest, smoothest, tightly integrated, and unobtrusive mechanism to get things done using the keyboard alone.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-getting-about/index.html",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 2859,
          "title": "Emerging from dotemacs bankruptcy the hard way: getting about",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-midway-refactor/",
          "author": null,
          "description": "Or the one in which we confront our elisp n00bishness and try to be better at using it. And we learn new habits to understand our Emacs better. Better late than never.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-midway-refactor/index.html",
          "publishedOn": "2023-07-23T00:00:00.000Z",
          "wordCount": 1778,
          "title": "Emerging from dotemacs bankruptcy the hard way: the midway refactor",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-packages/",
          "author": null,
          "description": "Elpa, Melpa, git repo. Vendor package straight from source. It compiled? Fetch some more! Elpa, Melpa, git repo. In more adult terms, we learn to use use-package to fetch, install, initialise, configure useful packages that enhance our Emacs experience.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-packages/index.html",
          "publishedOn": "2023-07-06T00:00:00.000Z",
          "wordCount": 1554,
          "title": "Emerging from dotemacs bankruptcy the hard way: package management",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-init-begins/",
          "author": null,
          "description": "The first action must, of course, be to colour the bikeshed and set some decent defaults.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-init-begins/index.html",
          "publishedOn": "2023-07-04T00:00:00.000Z",
          "wordCount": 727,
          "title": "Emerging from dotemacs bankruptcy the hard way: init begins",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy/",
          "author": null,
          "description": "Or, finally biting the bullet to redesigning my developerly and writerly experience, from the ground up, with Emacs.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy/index.html",
          "publishedOn": "2023-06-29T00:00:00.000Z",
          "wordCount": 566,
          "title": "Emerging from dotemacs bankruptcy the hard way: Prelude",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/what-have-you-been-curious-about/",
          "author": null,
          "description": "Arguably a more interesting, revealing, and kinder question than \"What are you curious about?\"",
          "link": "https://www.evalapply.org/posts/what-have-you-been-curious-about/index.html",
          "publishedOn": "2023-06-21T00:00:00.000Z",
          "wordCount": 504,
          "title": "What have you been curious about?",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/software-demos/",
          "author": null,
          "description": "Making a software demo is a form of deliberate, serious play. An act that feeds our curiosity, inventiveness, and drive. It enlivens. It enriches. It entertains. And as we asymptotically approach the A.G.I. that's just around the corner, the capacity for deliberate, serious play will remain distinctively, deeply, deliciously human. Career software people like yours truly may please take note!",
          "link": "https://www.evalapply.org/posts/software-demos/index.html",
          "publishedOn": "2023-06-04T00:00:00.000Z",
          "wordCount": 1572,
          "title": "Software demos as deliberate acts of serious play",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/cold-restart-total-outage/",
          "author": null,
          "description": "\"What are folks’ views on systems so large where cold-starting the whole system is almost impossible?\"... — M'colleague, Shivam, In A Slackroom Next Door.",
          "link": "https://www.evalapply.org/posts/cold-restart-total-outage/index.html",
          "publishedOn": "2023-04-07T00:00:00.000Z",
          "wordCount": 1169,
          "title": "Cold restart whole system after total outage",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Ian Henry",
      "feedUrl": "https://ianthehenry.com/feed.xml",
      "siteUrl": "https://ianthehenry.com/",
      "articles": [
        {
          "id": "https://ianthehenry.com/posts/fibonacci/",
          "author": null,
          "description": "When you think about the Fibonacci sequence, you probably imagine a swirling vortex of oscillating points stretching outwards to infinity:\n\n\n\nOkay, no, obviously you don’t. Yet.\nWhen you think about the Fibonacci sequence, you probably flush with a latent rage when you remember that it is, more often than not, the way that we introduce the concept of “recursive functions” to new programmers, in some sort of cruel hazing intended to make it harder for them to ever appreciate how recursion can help them write better programs. Sometimes we even add memoization, and call it “dynamic programming,” in order to impress upon them that even the most trivial problems deserve complex, inefficient solutions.\nEr, okay, you probably don’t think about the Fibonacci sequence much at all. It doesn’t, you k…",
          "link": "https://ianthehenry.com/posts/fibonacci/",
          "publishedOn": "2023-07-30T00:00:00.000Z",
          "wordCount": 5215,
          "title": "The Fibonacci Matrix",
          "imageUrl": "https://ianthehenry.com/posts/fibonacci/hero.png"
        },
        {
          "id": "https://ianthehenry.com/posts/my-kind-of-repl/",
          "author": null,
          "description": "I want to tell you about an idea that has had a huge influence on the way that I write software. And I mean that in the literal sense: it’s changed the way that I write software; it’s re-shaped my development workflow.\nThe idea is this: you can write programs that modify themselves.\nAnd I don’t mean macros or metaprogramming or anything fancy like that. I mean that you can write programs that edit their own source code. Like, the files themselves. The actual text files on disk that have your source code in them.\nThat’s not the whole idea, though. There’s more to it: you write programs that can edit themselves, and then you use that as your REPL.\nInstead of typing something into a prompt and hitting enter and seeing the output on stdout, you type something into a file and hit some editor ke…",
          "link": "https://ianthehenry.com/posts/my-kind-of-repl/",
          "publishedOn": "2023-07-05T00:00:00.000Z",
          "wordCount": 5535,
          "title": "My Kind of REPL",
          "imageUrl": "https://ianthehenry.com/posts/my-kind-of-repl/hero.png"
        },
        {
          "id": "https://ianthehenry.com/posts/generalized-macros/",
          "author": null,
          "description": "I’ve been writing a lot of Janet lately, and I’ve been especially enjoying my time with the macro system.\nJanet macros are Common Lisp-flavored unhygienic gensym-style macros. They are extremely powerful, and very easy to write, but they can be pretty tricky to get right. It’s easy to make mistakes that lead to unwanted variable capture, or to write macros that only work if they’re expanded in particular contexts, and it can be pretty difficult to detect these problems ahead of time.\nSo people have spent a lot of time thinking about ways to write macros more safely – sometimes at the cost of expressiveness or simplicity – and almost all recent languages use some sort of hygienic macro system that defaults to doing the right thing.\nBut as far as I know, no one has approached macro systems f…",
          "link": "https://ianthehenry.com/posts/generalized-macros/",
          "publishedOn": "2023-04-18T00:00:00.000Z",
          "wordCount": 4908,
          "title": "Generalized Macros",
          "imageUrl": "https://ianthehenry.com/checkerboard.png"
        },
        {
          "id": "https://ianthehenry.com/posts/why-janet/",
          "author": null,
          "description": "I never thought it could happen to me. I mean, parentheses? In this day and age? But for the past couple years, my go-to programming language for fun side projects has been a little Lisp dialect called Janet.\n(print \"hey janet\")\n\nI like Janet so much that I wrote an entire book about it, and put it on The Internet for free, in the hopes of attracting more Janetors to the language.\nI think you should read it, but I know that you don’t believe me, so I’m going to try to convince you. Here’s my attempt at a sales pitch: here is why you – you of all people – should give Janet a chance.\nJanet is simple\nJanet is an imperative language with first-class functions, a single namespace for identifiers, and lexical block scoping. The core of the language is very small, consisting of only eight instruc…",
          "link": "https://ianthehenry.com/posts/why-janet/",
          "publishedOn": "2023-04-12T00:00:00.000Z",
          "wordCount": 1631,
          "title": "Why Janet?",
          "imageUrl": "https://ianthehenry.com/checkerboard.png"
        },
        {
          "id": "https://ianthehenry.com/posts/janet-for-mortals/",
          "author": null,
          "description": "I wrote a book.\nIt’s called Janet for Mortals, and it’s free, and it’s on the internet, and you can read it right now.\nAnd you should read it right now, instead of reading this blog post, because this blog post is not very interesting if you haven’t read the book. Heck, this blog post is not very interesting even if you have read the book. This blog post is a thinly-veiled promotion for my book to slip into my newsletter and RSS feed, with just enough additional content to pad it out to the length of a real post.\nThe book is about Janet, a programming language that I have written about before. I’ve been using Janet a lot lately, and I’ve been having a lot of fun with it, and I think that more people should know about it so that they can have fun with it too. People like you.\nI’m not really…",
          "link": "https://ianthehenry.com/posts/janet-for-mortals/",
          "publishedOn": "2023-04-04T00:00:00.000Z",
          "wordCount": 3432,
          "title": "Janet for Mortals",
          "imageUrl": "https://ianthehenry.com/checkerboard.png"
        }
      ]
    },
    {
      "title": "Applied Language musings",
      "feedUrl": "https://applied-langua.ge/posts/feed.rss",
      "siteUrl": "https://applied-langua.ge/posts/",
      "articles": [
        {
          "id": "https://zenodo.org/record/7816398",
          "author": null,
          "description": "The design and implementation of a non-moving parallel generational garbage collector for SBCL.",
          "link": "https://zenodo.org/record/7816398",
          "publishedOn": "2024-01-01T00:01:34.206Z",
          "wordCount": 633,
          "title": "Parallel garbage collection for SBCL",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/the-poverty-of-post-open-source.html",
          "author": null,
          "description": "Post-open source falls short on what improvements it was supposed to make. It prefigures a boring future, mostly because it carries on productivist logic, and makes programming even more of a difficult and esoteric tool. Capitalism isn't the only problem threatening peer production; it is rather threatened by more general principles, which even radicals can believe.",
          "link": "https://applied-langua.ge/posts/the-poverty-of-post-open-source.html",
          "publishedOn": "2024-01-01T00:01:31.095Z",
          "wordCount": 4249,
          "title": "The poverty of \"post-open\" source",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/i-dont-want-to-go-to-chel-c.html",
          "author": null,
          "description": "When \"simple\" programming languages aren't.",
          "link": "https://applied-langua.ge/posts/i-dont-want-to-go-to-chel-c.html",
          "publishedOn": "2024-01-01T00:01:31.071Z",
          "wordCount": 7301,
          "title": "I don't want to go to Chel-C",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/omrn-compiler.html",
          "author": null,
          "description": "A pile of regular expression derivatives, myths about Ediware, SIMD instruction selection and using the Common Lisp compiler as a backend for a regular expression compiler.",
          "link": "https://applied-langua.ge/posts/omrn-compiler.html",
          "publishedOn": "2024-01-01T00:01:31.015Z",
          "wordCount": 3092,
          "title": "The one-more-re-nightmare compiler",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/lisp-curse-redemption-arc.html",
          "author": null,
          "description": "Pondering marketing strategies, and how we aren't supposed to be productive in Common Lisp.",
          "link": "https://applied-langua.ge/posts/lisp-curse-redemption-arc.html",
          "publishedOn": "2024-01-01T00:01:31.002Z",
          "wordCount": 3276,
          "title": "The Lisp Curse Redemption Arc",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/zero-feet.html",
          "author": null,
          "description": "A systems language is a collection of things that don't fit into a modular language. There shouldn't be one.",
          "link": "https://applied-langua.ge/posts/zero-feet.html",
          "publishedOn": "2024-01-01T00:01:30.900Z",
          "wordCount": 2014,
          "title": "Zero Feet: a proposal for a systems-free Lisp",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/the-next-700-virtual-machines.html",
          "author": null,
          "description": "Virtual machine will eat themselves, by being similar enough that most can subsume each other. This can be furthered by making it easier to target abstract machines, and using object capabilities to allow cohabitation of languages and incremental extension to languages.",
          "link": "https://applied-langua.ge/posts/the-next-700-virtual-machines.html",
          "publishedOn": "2024-01-01T00:01:30.868Z",
          "wordCount": 4640,
          "title": "The next 700 virtual machines",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/~hayley/pmrgc.html",
          "author": null,
          "description": "How to build the new parallel GC for SBCL, and how to tell if it's working.",
          "link": "https://applied-langua.ge/~hayley/pmrgc.html",
          "publishedOn": "2024-01-01T00:01:30.830Z",
          "wordCount": 1293,
          "title": "Please test the parallel mark-region collector for SBCL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Scientific Coder",
      "feedUrl": "https://scientificcoder.com/rss.xml",
      "siteUrl": "https://scientificcoder.com",
      "articles": [
        {
          "id": "https://scientificcoder.com/user-defined-show-method-in-julia",
          "author": "Matthijs Cox",
          "description": "I often find myself looking for a way to write custom display methods for Julia types on the REPL. Time to write it down in a short pragmatic blog post, for you and my future self.\nWhat's the issue? When exploring on the Julia REPL or in notebooks, you display your own custom type, then it doesn't look always look the most informative. Let's say you have some type:\nstruct MyType    some_number::Float64    some_dict::Dictend\nYou can quickly make an object and display it.\njulia> obj = MyType(4.0, Dict(:x => 5))MyType(4.0, Dict(:x => 5))\nOkay... Julia basically shows the constructor of the object. I would like to see the field names, or maybe other information. Sometimes I want to see statistical properties for example, instead of the raw data.\nAs an alternative, to quickly see the field name…",
          "link": "https://scientificcoder.com/user-defined-show-method-in-julia",
          "publishedOn": "2023-07-18T13:24:13.000Z",
          "wordCount": 7212,
          "title": "User-defined Show Method in Julia",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1689686215391%2F469dd124-564a-4ccf-a118-c1c9f885f6b6.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/juliacon-local-eindhoven-2023",
          "author": "Matthijs Cox",
          "description": "I am very happy to announce that I am an organizer of the first city-level JuliaCon conference. This will be a one-day event in Eindhoven on December 1st, organized together with the PyData Eindhoven conference on November 30th (the day before).\nThe website is live: https://juliacon.org/local/eindhoven2023/. You can submit proposals, book early-bird tickets and consider joining as a volunteer.\nWe named it \"JuliaCon Local\" to avoid any confusion with the yearly Global JuliaCon, which is typically also associated with a city name. The date is also positioned in the winter, to be out of sync with the summer schedule of the Global JuliaCon conferences. People who could not attend the Global JuliaCon now have another opportunity to meet like-minded Julians and computational scientists in the industry and academia.\nMy apologies if I notify you via multiple channels, including my blog, but we are really excited about growing our scientific computing community in the area. Please consider sharing the news with your network. Of course everyone on the planet is welcome to join our conference! Hopefully we are paving the path to more city-level JuliaCon conferences.",
          "link": "https://scientificcoder.com/juliacon-local-eindhoven-2023",
          "publishedOn": "2023-07-11T07:23:12.000Z",
          "wordCount": 2746,
          "title": "JuliaCon Local Eindhoven 2023",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1689059863447%2Ff5218ac5-7cf2-4036-bbd4-b6f01ff19866.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/how-to-deploy-algorithms-anywhere",
          "author": "Matthijs Cox",
          "description": "Let's say you are an incredible scientific programmer. You've got some pretty math, machine learning model or scientific computing code. And you want to give it to other users. Maybe even turn it into a real product and make a profit from your work. How do you \"deploy\" that piece of code? Most scientists do not think much about this problem at all, but it can have a great influence on how you should develop your code.\nBasically, we need to take what you developed, turn it into something which can be given to the user, so they can install and use it in their computing environment. What to provide depends entirely on the environment of the user. So you'll first need to understand that: the so called \"production environment\", the environment in which your \"product\" or service will operate.\n\nT…",
          "link": "https://scientificcoder.com/how-to-deploy-algorithms-anywhere",
          "publishedOn": "2023-07-09T12:41:35.000Z",
          "wordCount": 21321,
          "title": "How to deploy algorithms anywhere?",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1688895403637%2Fca806aa8-49ad-41dd-ab25-b3ba2db8ffe6.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/fruity-composable-design-patterns-in-julia",
          "author": "Matthijs Cox",
          "description": "A design pattern is a repeatable solution to a common coding problem. Design patterns are not something beginner programmers typically think about a lot (that includes most scientists), they are probably focused on making their code work. At least that's what I did when I was a young programmer. At the other extreme such patterns can become a religion for people, where everything has to be a design pattern, or else the code is not considered good enough. However, people who make this mistake are not senior programmers either in my opinion. Senior programmers look for a balance between pure abstraction and simplicity (and many other requirements).\nThe Julia community has a special standing on design patterns: people don't really like them. In general the Julia community believes that design…",
          "link": "https://scientificcoder.com/fruity-composable-design-patterns-in-julia",
          "publishedOn": "2023-06-23T12:18:08.000Z",
          "wordCount": 15899,
          "title": "Fruity Composable Design Patterns in Julia",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1687522411556%2Fc781ad27-554c-48bd-b6fc-f42d5f629591.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/software-testing-for-scientists",
          "author": "Matthijs Cox",
          "description": "I am currently reading the book \"Software Engineering for Science.\" It is one giant complaint about how scientists are terrible at writing maintainable code for themselves. I won't go into all the pain, but I do recognize that pain deeply and have written about it elsewhere. Right now I am reading this book hoping to find solutions. So, what's the proposed solution? The book doesn't provide a simple answer, but one recurring topic is \"testing, testing, TESTING!\" So, let's talk about testing!\nWhy don't scientists test their code? Well, it turns out that most scientists do not have a software engineering background, yet they find themselves writing code and software for their work. Alternatively, they may collaborate heavily with software engineers, either in academia or in the industry. If …",
          "link": "https://scientificcoder.com/software-testing-for-scientists",
          "publishedOn": "2023-06-11T12:35:26.000Z",
          "wordCount": 20268,
          "title": "Software Testing for Scientists",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1685970744744%2F3005ed53-27a0-4856-92d6-26ece2b8fe52.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/the-nebulous-mysteries-of-scientific-coding",
          "author": "Matthijs Cox",
          "description": "There is a concept in meta-rationality called nebulosity. I will look up the definition later, but in my own words nebulosity means the following:\n\nNebulosity: a concept or problem is ill-defined. You cannot describe it perfectly. The boundaries of the concept are unclear.\n\nNebulosity drives rational people crazy, its worse than NP-hard. Rational people need well defined problems. Even if you can prove that the problem cannot be solved, at least the problem itself should be known. But is this always possible?\nYou may have a problem that you can barely describe to yourself. You may feel some shape of it, intuitively in your mind, but you cannot explain it perfectly. You notice that it is especially difficult to explain the problem to people unknown to the domain around the problem. There is…",
          "link": "https://scientificcoder.com/the-nebulous-mysteries-of-scientific-coding",
          "publishedOn": "2023-06-03T11:56:48.000Z",
          "wordCount": 13821,
          "title": "The Nebulous Mysteries of Scientific Coding",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1685191473723%2F77306972-8aa3-41d0-85f4-9efef520f341.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/scientific-software-institutes",
          "author": "Matthijs Cox",
          "description": "Have you ever gone through life completely oblivious to something? I recently experienced that sensation when I stumbled upon an entire ecosystem of institutions, only learning about them after starting this blog. These organizations are dedicated to promoting better scientific software, which aligns with the mission of my blog. I wanted to know what's going on, so let's have a look at what's out there.\nI noticed the names of the fields of \"scientific software\" vary a little, but I consider all of these roughly equivalent:\n\nScientific Software\n\nResearch Software Engineering (RSE)\n\nScientific Computing\n\nNumerical Computing\n\nYes, there are differences between them, but all of them involve turning scientific knowledge into algorithms and software, and writing software to do scientific researc…",
          "link": "https://scientificcoder.com/scientific-software-institutes",
          "publishedOn": "2023-05-31T12:34:28.000Z",
          "wordCount": 9237,
          "title": "Scientific Software Institutes",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1682844193827%2F1b0a1c9d-fb03-4a75-9ca0-d3cbcb52d52b.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/clean-code-tips-for-scientists-1-reproducible-environments",
          "author": "Matthijs Cox",
          "description": "Author commentary: I am starting a \"clean code\" blog series with simple tips that you can integrate into your workflow. I often write long, complicated articles that try to teach a lot at once. This is an attempt to chop things up in bite-sized chunks. Note that the Clean Code books by Robert Martin are great, you should read them if you have time! If not, you can follow these short articles :)\nIf you've written a lot of scripts and shared some of those scripts with colleagues or others, then you probably encountered the problem that the code doesn't always work on their device, or produces different results. When this happens, people may quickly lose trust in your results and begin to ignore your work entirely. So making code reproducible is extremely important! Even if you are a scientis…",
          "link": "https://scientificcoder.com/clean-code-tips-for-scientists-1-reproducible-environments",
          "publishedOn": "2023-05-24T12:03:44.000Z",
          "wordCount": 10884,
          "title": "Clean Code Tips for Scientists #1 - Reproducible Environments",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1684413997401%2F753bc424-1698-4e8a-a951-cc7727a09e68.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/building-a-scalable-inner-source-ecosystem-for-collaborative-development",
          "author": "Matthijs Cox",
          "description": "Three years ago, we decided to embrace the Julia programming language to solve the two language problem at our organization. We want our scientists to join forces with software engineers so that they can work on the same problems together. In our journey, I could have used more books or blogs to guide us on the following topics:\n\nHow to build and deploy software products with the Julia language?\n\nHow to create the seeds for an effective scientific software ecosystem?\n\nThis article is here to help you with the second topic, but I warn you that we had to figure out 1 and 2 at the same time. I intend to write more blog posts about the Julia productization aspects. Yet in the long term, I am betting on the ecosystem to radically improve our organization, so I consider that more important to bl…",
          "link": "https://scientificcoder.com/building-a-scalable-inner-source-ecosystem-for-collaborative-development",
          "publishedOn": "2023-05-17T12:29:08.000Z",
          "wordCount": 27637,
          "title": "Building a Scalable Inner-Source Ecosystem For Collaborative Development",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1684239844476%2F70964039-8d34-410b-8507-79bfd01dcbc0.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/extreme-multi-threading-c-and-julia-19-integration",
          "author": "Matthijs Cox",
          "description": "In this tutorial we demonstrate how to call Julia libraries with multiple threads from C++. With the introduction of Julia 1.9 in May 2023, the runtime can dynamically \"adopt\" external threads, enabling the integration of Julia libraries into multi-threaded codebases written in other languages, such as C++. This article is written in collaboration with Evangelos Paradas, the maestro of algorithm deployment at ASML. Evangelos has been responsible for heavily testing and debugging this multi-threading feature. I humbly repeated the final results after his many trial-and-error attempts and summarized everything for you in this article.\nJulia in production\nJulia is a general-purpose language designed for scientific and numerical computing, striking a balance between speed and simplicity. The a…",
          "link": "https://scientificcoder.com/extreme-multi-threading-c-and-julia-19-integration",
          "publishedOn": "2023-05-11T14:10:09.000Z",
          "wordCount": 18439,
          "title": "Extreme Multi-Threading: C++ and Julia 1.9 Integration",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1683635341431%2F5562e663-f9ea-4cec-a0a8-e6c9da7578ef.jpeg%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/mastering-scientific-programming-practical-tips-and-tricks",
          "author": "Matthijs Cox",
          "description": "Scientific programming involves writing code to solve scientific problems. This can range from simulating complex physical phenomena to analyzing large datasets. While such software is incredibly important, it can be challenging for scientists to learn all the required software development skills. However, by gradually adding specific tricks into your workflow, you can enhance your coding efficiency and effectiveness.\nSoftware skills are important for everyone these days, including scientists. I see certain common risks if you do not spend effort on your code quality:\n\nIncorrect code leads to incorrect results, which means you may have to redo work or even risk damaging your reputation.\n\nUnreproducible code means others, including your future self, cannot verify your work, nor built on top…",
          "link": "https://scientificcoder.com/mastering-scientific-programming-practical-tips-and-tricks",
          "publishedOn": "2023-05-10T09:46:17.000Z",
          "wordCount": 9073,
          "title": "Mastering Scientific Programming: Practical Tips and Tricks",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1683568993032%2Ff57416c5-3a85-4420-9074-0559b752625b.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/how-to-solve-the-two-language-problem",
          "author": "Matthijs Cox",
          "description": "My professional obsession is solving the Two Culture Problem. How can scientists optimally join forces with software engineers and their principles, so that we can work on the same problems together? How to accelerate the cycle from idea to product? The Two Culture Problem requires a solution to the related Two Language Problem, which has a technical nature. A solution to the technical problem does not guarantee a solution to the organizational problem, but when it comes to engineering cultures you first need to prove the technical solution before you can even begin to tackle the social implications. I have a strong opinion on the best technical solution, but let's review all our options.\n\nAs far as I can tell, we have the following alternatives:\n\nAccept the status quo: use a slow and a fa…",
          "link": "https://scientificcoder.com/how-to-solve-the-two-language-problem",
          "publishedOn": "2023-05-08T07:41:53.000Z",
          "wordCount": 32565,
          "title": "How to solve the two language problem?",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1683112298365%2Fe6ad9ad6-a363-45cc-a04f-a6f38510bf2f.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/production-ready-code-for-scientists-3-lessons-learned",
          "author": "Matthijs Cox",
          "description": "How do you become a great scientific coder? To understand this, I want to ask others about their journey and share their lessons with you. This post is a collaboration with Keith Myerscough, a mathematical consultant and senior engineer, who helped me with setting up our internal Julia language ecosystem.\nMatthijs asked me to write a guest post about what skills are needed to become a great scientific coder. He asked me because I assisted a team of scientists in adopting Julia for their research and development work. I am keen to help: I empathize with people who come up with great ideas but have a hard time wrapping these up into something that can be turned into a product. Even under the assumption that code will be extensively improved upon by others with more software knowledge, that f…",
          "link": "https://scientificcoder.com/production-ready-code-for-scientists-3-lessons-learned",
          "publishedOn": "2023-05-04T09:43:36.000Z",
          "wordCount": 11618,
          "title": "Production-ready code for scientists:  3 lessons learned",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1683010031069%2Fa33212ab-1534-4842-92cd-a94b4e89785c.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/automate-your-code-quality-in-julia",
          "author": "Matthijs Cox",
          "description": "Code quality is a topic in Julia that I believe deserves more attention from both users and developers. The Julia language originated in academia and focused heavily on helping scientists write better code, which is going great and deserves much praise! However, to onboard more software engineers and professional organizations we're going to have to invest even further into code quality and automated code quality tools and other methods such as used in the field of \"quality assurance\". In this article I'll explore the current state in the Julia ecosystem.\nAt our workplace we have investigated the following tools and practices. I'll start from generic practices and then move on to more advanced tools.\n\nPackage structure\n\nUnit testing with Pkg.jl\n\nAutomated testing and Continuous Integration…",
          "link": "https://scientificcoder.com/automate-your-code-quality-in-julia",
          "publishedOn": "2023-04-26T07:47:00.000Z",
          "wordCount": 22321,
          "title": "Automate Your Code Quality In Julia",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1682430557530%2F69f045a8-635c-4ec6-b836-dbdcf7f0dd23.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/the-art-of-multiple-dispatch",
          "author": "Matthijs Cox",
          "description": "I love thinking visually by drawing doodles and schematics for my work. It's one of my favorite things to do, next to coding. When working with the Julia language, one visualization I enjoy is seeing the type space of a method that you are dispatching on. Normally I do this in my mind's eye, but let me clarify this by drawing some actual figures.\nTo start with the basics; Julia has functions and methods. A function is simply the name, like push! or read . Methods are specific definitions of a function, for certain types of arguments. Take for example push!(s::Set, x) or read(io::IO) . From an object-oriented perspective you could say that methods are instances of functions.\n\nFor any given method you can consider the dispatching as slicing a part of the entire possible type space of that gi…",
          "link": "https://scientificcoder.com/the-art-of-multiple-dispatch",
          "publishedOn": "2023-04-20T09:01:49.000Z",
          "wordCount": 9965,
          "title": "The Art of Multiple Dispatch",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1681976569505%2Fe92f2398-d079-449e-ac6a-4b194fe226ac.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/my-target-audience",
          "author": "Matthijs Cox",
          "description": "What kind of people do I have in mind while writing this blog? People who share my professional mission of course! What is that mission you ask? Let me elaborate.\nFrom Research to Engineering\nI am a scientist who danced with startups and moved into industry. I've spend years doing research, and years doing software product development. During those years I have gotten slightly frustrated with the process of moving ideas from research to production, primarily in my favorite field of scientific computing.\nThe typical problem is that the time from research to production can be long, often spanning multiple years per project, and the process can be error prone. Some common smaller issues I see arising in many of our projects:\n\nUnreproducible, unexplainable scripts or notebooks in research\n\nEff…",
          "link": "https://scientificcoder.com/my-target-audience",
          "publishedOn": "2023-04-18T11:46:15.000Z",
          "wordCount": 10380,
          "title": "My Target Audience",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1681818346405%2Fb3103eb1-9008-42ce-a071-5c9a927b4ce0.png%3Fw%3D1200%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/why-this-blog",
          "author": "Matthijs Cox",
          "description": "My goal in life is to follow my curiosity and help others with the knowledge I uncover. A solid way to help people is to reflect on the last years and think about what would have helped your past self. In my case, I have been busy trying to develop and deploy numerical computing applications with the Julia language. One thing that I found lacking was good material on how to do numerical computing professionally in the industry, something I learned is sometimes called \"scientific software engineering\". A book or blog about large-scale development and deployment into production systems would have helped me tremendously. I had to learn most things the hard way through trial and error.\nSince what I need doesn't exist, we will have to make it exist! That's this blog!\nI have been blogging about …",
          "link": "https://scientificcoder.com/why-this-blog",
          "publishedOn": "2023-04-16T17:27:18.000Z",
          "wordCount": 7181,
          "title": "Why this blog?",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1681655524424%2F8208e14f-0765-4eb2-a301-4d9470f26e45.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        }
      ]
    },
    {
      "title": "妖怪世捨て人",
      "feedUrl": "https://tymoon.eu/api/reader/atom",
      "siteUrl": "https://reader.tymoon.eu/",
      "articles": [
        {
          "id": "https://reader.tymoon.eu/article/433",
          "author": null,
          "description": "I've been writing libraries for Common Lisp for over a decade now (lord almighty), and for most of that time I've tried to ensure that the libraries would, in the very least, work on all three major operating systems: Windows, Linux, and MacOS.\nUsually doing so isn't hard, as I can rely on the implementation and the language standard, but especially for libraries that deal with foreign code or operating system interfaces, a bit more work is needed. For the longest time I went the extra mile of providing that support myself, despite not being a MacOS user, and despite vehemently disapproving of Apple as a company and their treatment of users and developers.\nAbout two years ago, I stopped. I had had enough of all the extra work the platform put on me, for zero personal gain. Especially I had…",
          "link": "https://reader.tymoon.eu/article/433",
          "publishedOn": "2023-11-27T14:04:32.000Z",
          "wordCount": 412,
          "title": "The State of MacOS Support",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2517"
        },
        {
          "id": "https://reader.tymoon.eu/article/432",
          "author": null,
          "description": "I've been debating opening up a Patreon for many years and I've always been hesitant about accepting donations from people, but I think it's finally time to change my mind on that!\nWhy make a Patreon now?\nI've been working full time on Kandria and associated projects since 2020, and continue to do so today. All of the work that I've done as part of that has been released as open source software, including Kandria itself as well as the engine it runs on, Trial.\nSince the release, I've mostly focused on support and the pre-pre-production of my next title, which primarily involves adding new features to Trial that are necessary to create a full-3D game. I can't yet announce much about the game itself, other than that it is a character action game, meaning it features third-person hack and sla…",
          "link": "https://reader.tymoon.eu/article/432",
          "publishedOn": "2023-08-25T12:45:54.000Z",
          "wordCount": 557,
          "title": "I've opened up a Patreon - Confession 93",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2570"
        },
        {
          "id": "https://reader.tymoon.eu/article/431",
          "author": null,
          "description": "If you've read any of my preceding entries I would expect it to come as no surprise to you to see me write \"accepting who you are is really difficult.\" Though today I want to write about a few different facets of that than just the one you may be thinking about right now.\nNaturally, for only recently coming out as trans, accepting that I am a woman is a large part of what's been coursing through my brain. I know with absolute certainty by now that I'm not wrong on this, and yet it's still not easy to fully come to terms with it and not just know it, but also understand it completely. I know that coming out as trans did not change me, but rather let me be who I've always been, even more so. Despite that it's still not obvious even to me which of the many fragments of my personality that wer…",
          "link": "https://reader.tymoon.eu/article/431",
          "publishedOn": "2023-08-08T21:11:52.000Z",
          "wordCount": 1893,
          "title": "Selbstsamkeit - Confession 92",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2518"
        },
        {
          "id": "https://reader.tymoon.eu/article/430",
          "author": null,
          "description": "I don't like sleeping. I like the idea of sleep, but the practise of it seems all too often fraught with issues for me. I do consider myself fortunate that I don't suffer from any major sleeping disabilities like insomnia, but my quality of sleep is nevertheless far from ideal, despite adhering to a rather strict and regular sleeping schedule.\nI frequently grind my teeth during sleep, and so have started wearing a denture during the night. The denture makes things permanently uncomfortable, and I honestly don't know if it's the major cause of me grinding my teeth at this point. I definitely wouldn't be surprised at all if it exacerbates the problem. I don't know why I grind my teeth, though I figure that since most of the time I can't remember my dreams at all, and when I do, they're usual…",
          "link": "https://reader.tymoon.eu/article/430",
          "publishedOn": "2023-07-22T08:59:01.000Z",
          "wordCount": 2091,
          "title": "Die Toteninsel - Confession 91",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2537"
        },
        {
          "id": "https://reader.tymoon.eu/article/429",
          "author": null,
          "description": "Hello everyone. It's been a while since the last update. I apologise for the silence, things have slipped out of habit a little bit, and besides there's just been a lot of work on things that aren't easy to talk about. I'm still stuck in the R&D phase for the next game, and probably will continue to be there for a few more months before I can properly enter pre-production.\nI've really needed some space away from Kandria for a while, too. I did still release patches in the meantime to fix some egregious problems and bring the source back up to date with the latest changes in the Trial engine. The final DLC update with official modding support is still in the works, but given how little response there's been to the level editor update I'm not making it a big priority.\nThe financials for Kand…",
          "link": "https://reader.tymoon.eu/article/429",
          "publishedOn": "2023-06-13T15:23:27.000Z",
          "wordCount": 651,
          "title": "A status update on Kandria, Shirakumo, and me",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2438"
        },
        {
          "id": "https://reader.tymoon.eu/article/428",
          "author": null,
          "description": "Kandriaの日本語アップデートはリリースです！\n(私の日本語はまだまだですから、すみません)\n私のゲームは日本語でリリースのは夢ですからうれしい！Mimirin(@mioda833)さんはKandriaの日本語バーシオンを作ってありがとう。素晴らしい仕事をできた。\n今からSteamとItch.ioとKandria.comでアップデーとをダウンロードできる。",
          "link": "https://reader.tymoon.eu/article/428",
          "publishedOn": "2023-04-12T12:55:57.000Z",
          "wordCount": 57,
          "title": "Kandriaの日本語アップデートはリリースです！",
          "imageUrl": null
        },
        {
          "id": "https://reader.tymoon.eu/article/427",
          "author": null,
          "description": "Another month gone by. There's no major updates this month, since we just had the level editor release last month. However, there is a somewhat major update coming out next week!\nYou may have guessed from the title, but we're adding Japanese localisation to the game! It'll release on Wednesday, 12th of April. As someone that's been trying to learn Japanese for a long time, this is another step in the development that I've been looking forward to very much.\n\nI'm also really glad that we can release this already, so it'll be well out by the time I visit Tokyo Game Show in September!\nOther news\nWith the level editor and the beginning of the modding support already in place, I've taken a bit of a step back from Kandria development for a bit, and instead focused on working on a lot of other stuff that's been way overdue, like moving and upgrading our servers, taking care of my mental health, and starting work on pre-pre-production for the next game.\nHowever, Kandria development is not yet done. The second and final major update with an official modding API is still coming. I don't have a release date for that yet, so I hope you remain patient!\nIn the meantime, my paper for the European Lisp Symposium in Amsterdam was accepted, so I will be presenting Kandria there. The paper is quite technical, but if you're interested in Common Lisp, it might be worth a read. And if you're going to be in Amsterdam, let me know. I'd be happy to chat!\nThat's it for now\nA rather short update this month, but if you're interested in the details of the pre-pre-production process, come on hang out in the Shirakumo channel with the rest of us! We're discussing all the improvements to Trial there.",
          "link": "https://reader.tymoon.eu/article/427",
          "publishedOn": "2023-04-03T10:48:00.000Z",
          "wordCount": 347,
          "title": "次は…何？ - April Kandria Update",
          "imageUrl": "https://filebox.tymoon.eu//file/TWpZM09BPT0="
        },
        {
          "id": "https://reader.tymoon.eu/article/425",
          "author": null,
          "description": "The first major update for Kandria is now live on all platforms! It includes the level editor, a modding system, some new sample levels, and bugfixes!\nLevel Editor\nThe level editor received a big overhaul and is now a lot more accessible. There's also official documentation now to help get you started and explain all the tools and shortcuts available. If you want to dig in, just update your game and navigate to Mod Manager > Create Mod, which should place you directly into the editor in a new world of your own!\nSharing Mods\nYou can play levels made by others and download them directly from within the game. To browse existing levels, simply go to Mod Manager > Discover. From there you can select and install mods. Once installed, you can play their world under the Worlds tab.\nWe've provided …",
          "link": "https://reader.tymoon.eu/article/425",
          "publishedOn": "2023-03-08T13:47:42.000Z",
          "wordCount": 539,
          "title": "Level Editor Update is Live!",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2379"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}