{
  "sources": [
    {
      "title": "Stochastic Lifestyle",
      "feedUrl": "http://www.stochasticlifestyle.com/feed/",
      "siteUrl": "https://www.stochasticlifestyle.com/",
      "articles": [
        {
          "id": "https://www.stochasticlifestyle.com/?p=1758",
          "author": "Christopher Rackauckas",
          "description": "Many problems can be reduced down to solving f(x)=0, maybe even more than you think! Solving a stiff differential equation? Finding out where the ball hits the ground? Solving an inverse problem to find the parameters to fit a model? In this talk we’ll showcase how SciML’s NonlinearSolve.jl is a general system for solving nonlinear equations and demonstrate its ability to efficiently handle these kinds of problems with high stability and performance. We will focus on how compilers are being integrated into the numerical stack so that many of the things that were manual before, such as defining sparsity patterns, Jacobians, and adjoints, are all automated out-of-the-box making it greatly outperform purely numerical codes like SciPy or NLsolve.jl.\nPyData Global 2023\nThe post Symbolic-Numerics: how compiler smarts can help improve the performance of numerical methods (nonlinear solvers in Julia) appeared first on Stochastic Lifestyle.",
          "link": "https://www.stochasticlifestyle.com/symbolic-numerics-how-compiler-smarts-can-help-improve-the-performance-of-numerical-methods-nonlinear-solvers-in-julia/",
          "publishedOn": "2024-02-13T10:06:17.000Z",
          "wordCount": 1393,
          "title": "Symbolic-Numerics: how compiler smarts can help improve the performance of numerical methods (nonlinear solvers in Julia)",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1751",
          "author": "Christopher Rackauckas",
          "description": "Semantic versioning is great. If you don’t know what it is, it’s just a versioning scheme for software that goes MAJOR.MINOR.PATCH, where\nMAJOR version when you make incompatible API changes\nMINOR version when you add functionality in a backward compatible manner\nPATCH version when you make backward compatible bug fixes\nThat’s all it is, but it’s a pretty good system. If you see someone has updated their package from v3.2.0 to v3.2.1, then you know that you can just take that update because it’s just a patch, it won’t break your code. You can easily accept patch updates. Meanwhile, if you see they released v3.3.0, then you know that some new features were added, but it’s safe for you to update. This allows you to be compatible with v3.3.0 so that if a different package requires it, great you can both use it!  ... READ MORE\nThe post Semantic Versioning (Semver) is flawed, and Downgrade CI is required to fix it appeared first on Stochastic Lifestyle.",
          "link": "https://www.stochasticlifestyle.com/semantic-versioning-semver-is-flawed-and-downgrade-ci-is-required-to-fix-it/",
          "publishedOn": "2024-02-11T12:44:34.000Z",
          "wordCount": 3390,
          "title": "Semantic Versioning (Semver) is flawed, and Downgrade CI is required to fix it",
          "imageUrl": "https://imgs.xkcd.com/comics/workflow.png"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1732",
          "author": "Christopher Rackauckas",
          "description": "Machine learning is all about examples. The more data you have, the better it should perform, right? With the rise of ChatGPT and Large Language Models (LLMs) as a code helping tool, it was thus just an assumption that the most popular languages like Python would likely be the best for LLMs. But because of the increased productivity, I tend to use a lot of Julia, a language with  an estimated user-base of around a million programmers. For this reason, people have often asked me how it fairs with ChatGPT, Github Copilot, etc., and so I checked out those pieces and… was stunned. It’s really good. It seemed better than Python actually?\nThe data is in: Julia does well with ChatGPT\nThis question was recently put to the test by a researcher named Alessio Buscemi in A Comparative Study  ... READ MORE\nThe post ChatGPT performs better on Julia than Python (and R) for Large Language Model (LLM) Code Generation. Why? appeared first on Stochastic Lifestyle.",
          "link": "https://www.stochasticlifestyle.com/chatgpt-performs-better-on-julia-than-python-and-r-for-large-language-model-llm-code-generation-why/",
          "publishedOn": "2023-11-19T15:57:36.000Z",
          "wordCount": 3171,
          "title": "ChatGPT performs better on Julia than Python (and R) for Large Language Model (LLM) Code Generation. Why?",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1729",
          "author": "Christopher Rackauckas",
          "description": "I’m pleased to share a talk I gave in the DDPS seminar series!\n\nData-driven Physical Simulations (DDPS) Seminar Series\nAbstract: The combination of scientific models into deep learning structures, commonly referred to as scientific machine learning (SciML), has made great strides in the last few years in incorporating models such as ODEs and PDEs into deep learning through differentiable simulation. However, the vast space of scientific simulation also includes models like jump diffusions, agent-based models, and more. Is SciML constrained to the simple continuous cases or is there a way to generalize to more advanced model forms? This talk will dive into the mathematical aspects of generalizing differentiable simulation to discuss cases like chaotic simulations, differentiating stochastic simulations like particle filters and agent-based models, and solving  ... READ MORE\nThe post DDPS Seminar Talk: Generalizing Scientific Machine Learning and Differentiable Simulation Beyond Continuous models appeared first on Stochastic Lifestyle.",
          "link": "https://www.stochasticlifestyle.com/ddps-seminar-talk-generalizing-scientific-machine-learning-and-differentiable-simulation-beyond-continuous-models/",
          "publishedOn": "2023-11-12T11:54:03.000Z",
          "wordCount": 1576,
          "title": "DDPS Seminar Talk: Generalizing Scientific Machine Learning and Differentiable Simulation Beyond Continuous models",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        },
        {
          "id": "https://www.stochasticlifestyle.com/?p=1723",
          "author": "Christopher Rackauckas",
          "description": "This is a repost of my response on the Julia Discourse on this topic. I was asked to make a blog post so here you go!\nThe “Main” Plotting Packages\nHere’s a quick summary of the most widely used plotting packages. I may have missed one, but I haven’t missed one that is very widely used.\nPlots.jl is the most used. It’s probably the most documented, used in the most tutorials, and is used in many videos.\n\nPros: Its main draw is that it has a lot of plugins to other packages through its recipes system, which means that a lot of odd things like `plot(sol::ODESolution)` or showing the sparsity of a `BandedMatrix` just works. With all of these integrations, it’s normally what I would recommend first to newcomers since they will generally get the most done with the least work. It  ... READ MORE\nThe post Summary of Julia Plotting Packages appeared first on Stochastic Lifestyle.",
          "link": "https://www.stochasticlifestyle.com/summary-of-julia-plotting-packages/",
          "publishedOn": "2023-06-17T14:23:29.000Z",
          "wordCount": 2487,
          "title": "Summary of Julia Plotting Packages",
          "imageUrl": "//www.stochasticlifestyle.com/wp-content/themes/chrisrack/style/faviPic2.PNG"
        }
      ]
    },
    {
      "title": "Andrej Karpathy blog",
      "feedUrl": "http://karpathy.github.io/feed.xml",
      "siteUrl": "http://karpathy.github.io/",
      "articles": []
    },
    {
      "title": "Mosè Giordano",
      "feedUrl": "https://giordano.github.io/blog/feed.xml",
      "siteUrl": "http://giordano.github.io",
      "articles": []
    },
    {
      "title": "Shuhei Kadowaki&#39;s homepage",
      "feedUrl": "https://aviatesk.github.io/feed.xml",
      "siteUrl": "https://aviatesk.github.io/",
      "articles": []
    },
    {
      "title": "Mike Innes’s Blog",
      "feedUrl": "https://mikeinnes.io/feed.xml",
      "siteUrl": "/",
      "articles": [
        {
          "id": "https://mikeinnes.io/2023/06/06/mojo.html",
          "author": null,
          "description": "Last month a startup called Modular released a new language called Mojo (not to be confused with the existing indigenous one). Based on Python and designed for ML hardware and models, Mojo’s goals (“the usability of Python with the performance of C”) coincide with those of the Julia language, so I’m interested to compare notes.[^1]",
          "link": "https://mikeinnes.io/2023/06/06/mojo.html",
          "publishedOn": "2023-06-06T00:00:00.000Z",
          "wordCount": 2164,
          "title": "Finding Your Mojo",
          "imageUrl": null
        },
        {
          "id": "https://mikeinnes.io/2023/05/30/data.html",
          "author": null,
          "description": "Most programming languages conflate the building of data structures and the modelling of information.",
          "link": "https://mikeinnes.io/2023/05/30/data.html",
          "publishedOn": "2023-05-30T00:00:00.000Z",
          "wordCount": 533,
          "title": "Data Structures, Data Modelling",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Tom Kwong's Infinite Loop",
      "feedUrl": "https://ahsmart.com/feed.xml",
      "siteUrl": "https://ahsmart.com/",
      "articles": []
    },
    {
      "title": "JuliaLang - The Julia programming language",
      "feedUrl": "https://julialang.org/feed.xml",
      "siteUrl": "https://julialang.org/",
      "articles": [
        {
          "id": "https://julialang.org/blog/2023/12/julia-1.10-highlights/",
          "author": null,
          "description": "Highlights of the Julia 1.10 release.\nRead more",
          "link": "https://julialang.org/blog/2023/12/julia-1.10-highlights/",
          "publishedOn": "2023-12-27T00:00:00.000Z",
          "wordCount": 2156,
          "title": "Julia 1.10 Highlights",
          "imageUrl": "/assets/images/julia-open-graph.png"
        },
        {
          "id": "https://julialang.org/blog/2023/07/PSA-dont-use-threadid/",
          "author": null,
          "description": "PSA: Thread-local state is no longer recommended; Common misconceptions about threadid() and nthreads()\nRead more",
          "link": "https://julialang.org/blog/2023/07/PSA-dont-use-threadid/",
          "publishedOn": "2023-07-06T00:00:00.000Z",
          "wordCount": 2272,
          "title": "PSA: Thread-local state is no longer recommended",
          "imageUrl": "/assets/images/julia-open-graph.png"
        }
      ]
    },
    {
      "title": "Ted Kaminski",
      "feedUrl": "https://www.tedinski.com/feed.xml",
      "siteUrl": "http://www.tedinski.com/",
      "articles": []
    },
    {
      "title": "Invenia Blog",
      "feedUrl": "https://invenia.github.io/blog/feed.xml",
      "siteUrl": "https://invenia.github.io/blog/",
      "articles": []
    },
    {
      "title": "Two-Bit History",
      "feedUrl": "https://twobithistory.org/feed.xml",
      "siteUrl": "https://twobithistory.org/",
      "articles": []
    },
    {
      "title": "programming (and other) musings",
      "feedUrl": "https://jao.io/blog/rss.xml",
      "siteUrl": "https://jao.io/blog/",
      "articles": [
        {
          "id": "https://jao.io/blog/poor-things.html",
          "author": null,
          "description": "I've read good things about the forthcoming movie, and liked what I saw in the\npromotional video, but I cannot believe it's going to be near as good as this\nnovel. The book has too many nuances, literary tricks and wordplay and\nparagraphs one has to read and reread, to be translated to a film. The latter\nmight be its own work of art, and that's fine. But if you're curious about the\nmovie, I'd definitely recommend to read this book. If you're not, I'd\ndefinitely recommend to read this book. The writing is fresh and funny, in\ntypical Gray fashion, and the real themes of the book are universal and\nexposed in a way that is very entertaining on the surface, but with a subtext\nthat gives you food for thought. I don't remember when was the last time that\nI read two hundred pages of a book in a single day, time just flew, as they\nsay.\n\nTags: books",
          "link": "https://jao.io/blog/poor-things.html",
          "publishedOn": "2023-10-11T01:28:00.000Z",
          "wordCount": 197,
          "title": "poor things",
          "imageUrl": null
        },
        {
          "id": "https://jao.io/blog/in-no-particular-order.html",
          "author": null,
          "description": "Interesting bits elsewhere:\n\n\n\nTimeless Advice on Writing: The Collected Wisdom of Great Writers\nLeaving Haskell behind — Infinite Negative Utility\nKnuth: Ancient Babylonian Algorithms annotated/explained version.\nMastering Bloom Filters: Big Data Processing in Python\nOlder entries\n\n\n\nTags: sundry",
          "link": "https://jao.io/blog/in-no-particular-order.html",
          "publishedOn": "2023-10-11T01:00:00.000Z",
          "wordCount": 78,
          "title": "in no particular order",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "wingolog",
      "feedUrl": "https://wingolog.org/feed/atom",
      "siteUrl": "https://wingolog.org/",
      "articles": [
        {
          "id": "https://wingolog.org/archives/2024/02/26/on-the-impossibility-of-composing-finalizers-and-ffi",
          "author": null,
          "description": "While poking the other day at making a Guile binding for\n, I remembered why I don’t much do this\nany more: it is impossible to compose GC with explicit ownership.Harfbuzz\nAllow me to illustrate with an example.  Harfbuzz has a concept of , which are\nrefcounted sequences of bytes.  It uses these in a number of places, for example when loading OpenType fonts.\nYou can get a peek at the blob’s contents back with\n,\nwhich gives you a pointer and a length.blobshb_blob_get_data\nSay you are in LuaJIT.  (To think that for a couple years, I wrote\nLuaJIT all day long; now I can hardly remember.)  You get a blob from\nsomewhere and want to get its data.  You define a wrapper for\n:hb_blob_get_data\nPresumably you then arrange to release LuaJIT’s reference on the blob\nwhen GC collects a Lua wrapper for a b…",
          "link": "https://wingolog.org/archives/2024/02/26/on-the-impossibility-of-composing-finalizers-and-ffi",
          "publishedOn": "2024-02-26T10:05:43.000Z",
          "wordCount": 2656,
          "title": "on the impossibility of composing finalizers and ffi",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/02/16/guix-on-the-framework-13-amd",
          "author": null,
          "description": "I got a new laptop!  It’s a : 8 cores, 2 threads per core, 64 GB RAM, 3:2 2256×1504 matte screen.  It kicks my 5-year-old Dell XPS 13 in the pants, and I am so relieved to be back to a matte screen.  I just got it up and running with , which though easier than past installation experiences was not without some wrinkles, so here I wanted to share a recipe for what worked for me.Framework 13 AMDGuix\n(I swear this isn’t going to become a product review blog, but when I went to post something like this on the   I got an error saying that new users could only post 2 links.  I understand how we got here but hoo, that is a garbage experience!)Framework forum\nUpstream Guix works on the Framework 13 AMD, but only with software rendering and no wifi, and I wasn’t able to install from upstream media.…",
          "link": "https://wingolog.org/archives/2024/02/16/guix-on-the-framework-13-amd",
          "publishedOn": "2024-02-16T10:23:43.000Z",
          "wordCount": 2608,
          "title": "guix on the framework 13 amd",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/02/14/family-bike-transportation",
          "author": null,
          "description": "Good evening!  Tonight I have a brief and unusual post, which is a product review of an electric cargo bike and its accessories for transporting kids.  Let’s see if I can get this finished while I wait for my new laptop to finish installing.\nSo, I have three young kids (5yo, 3yo, 1yo), and I need to get them places.  Before the 3rd was born I would use a bike trailer (, bought when there was just one kid) and a bike seat (, attached on seat-post).  That was fine, though sometimes the thought of lugging their ever-increasing kilograms somewhere would give me pause.  Then when the third kid arrived, hoo boy; I got a front-mount , to see if I could do three kids on one me-powered bike, but that was too tight to manage; not enough space to kick my leg over when getting on.Thule Chariot Lite si…",
          "link": "https://wingolog.org/archives/2024/02/14/family-bike-transportation",
          "publishedOn": "2024-02-14T21:49:24.000Z",
          "wordCount": 1602,
          "title": "family bike transportation",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/01/18/nombrilliant-actually",
          "author": null,
          "description": "Today, a middle-aged note: when you are young, unless you been\nfailed by The System, you enjoy a radiant confidence: everything you say\nburns with rightness and righteousness, that the world Actually Is This\nWay, You See, and if you think about it, it Actually Should Be This\nOther Specific Way.  This is how you get the fervent young communists\nand Scala enthusiasts and ecologists and Ayn Randians.  The ideas are so\nright that you become an evangelist, a\n,\na truth-speaker; a youtuber, perhaps.prophet\nThen, with luck, you meet the world: you build, you organize, you\ninvest, you double down.  And in that doubling, the ideas waver,\ntremble, resonate, imperceptibly at first, reinforced in some ways,\nimpeded in others.  The world works in specific ways, too, and you don’t\nreally know them in the…",
          "link": "https://wingolog.org/archives/2024/01/18/nombrilliant-actually",
          "publishedOn": "2024-01-18T23:15:58.000Z",
          "wordCount": 1377,
          "title": "nombrilliant, actually",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/01/11/micro-macro-story-time",
          "author": null,
          "description": "Today, a tiny tale:  I was working\non .\nGuile inherited this code from an early version of Kent Dybvig’s\n.  It\nwas... not easy to work with.about 15 years\nagoGuile’s macro\nexpanderportable syntax\nexpander\nSome difficulties were essential.  Scope is tricky, after all.\nSome difficulties were incidental, but deep.  The expander is ultimately\na function that translates Scheme-with-macros to Scheme-without-macros.\nHowever, it is itself written in Scheme-with-macros, so to load it on a\nsubstrate without macros requires a ,\nwhose data representations need to be compatible with any incremental\nchange, so that you will be able to use the new expander to produce a\nfresh pre-expansion.  This difficulty could have been avoided by\n.  It\nworks once you are used to it, but it’s gnarly.pre-expanded copy o…",
          "link": "https://wingolog.org/archives/2024/01/11/micro-macro-story-time",
          "publishedOn": "2024-01-11T14:10:38.000Z",
          "wordCount": 1319,
          "title": "micro macro story time",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/01/08/missing-the-point-of-webassembly",
          "author": null,
          "description": "I find most descriptions of WebAssembly to be uninspiring: if you\nstart with a phrase like “assembly-like language” or a “virtual machine”,\nwe have already lost the plot.  That’s not to say that these\ndescriptions are incorrect, but it’s like explaining what a dog is by\nstarting with its circulatory system.  You’re not wrong, but you should probably lead with the bark.\nI have a different preferred starting point which is less descriptive\nbut more operational: .  WebAssembly is a new way of dividing computing systems into\npieces and of composing systems from parts.WebAssembly is a new fundamental abstraction\nboundary\nThis all may sound high-falutin´, but it’s for real: this is the\nactually interesting thing about Wasm.\nIt’s probably easiest to explain what I mean by example.  Consider the\nL…",
          "link": "https://wingolog.org/archives/2024/01/08/missing-the-point-of-webassembly",
          "publishedOn": "2024-01-08T11:45:39.000Z",
          "wordCount": 3467,
          "title": "missing the point of webassembly",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/01/05/scheme-modules-vs-whole-program-compilation-fight",
          "author": null,
          "description": "In a recent dispatch, I explained .\nToday’s note explores what a correct solution might look like.the whole-program compilation\nstrategy used in Whiffle and\nHoot\nConsider a module that exports an increment-this-integer procedure.\nWe’ll use syntax from the :R6RS\nstandard\nIf we then have a program:\nThen the meaning of this program is clear: it reduces to ,\nthen to 43.  Fine enough.  But how do we get there?  How does the\ncompiler compose the program with the modules that it uses\n(transitively), to produce a single output?(+ 42 1)\nIn\n\n(and ), the answer is,\nsloppily.  There is a \nthat initially has a number of bindings from the host compiler,\n.  One of these is , exposed under\nthe name , where the  in this case is just a warning to the reader that this is a weird\nprimitive binding.  Using thi…",
          "link": "https://wingolog.org/archives/2024/01/05/scheme-modules-vs-whole-program-compilation-fight",
          "publishedOn": "2024-01-05T20:43:49.000Z",
          "wordCount": 2460,
          "title": "scheme modules vs whole-program compilation: fight",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2024/01/05/v8s-precise-field-logging-remembered-set",
          "author": null,
          "description": "A  is used by a garbage collector to identify graph\nedges between partitioned sub-spaces of a heap.  The canonical example\nis in generational collection, where you allocate new objects in\n, and eventually promote survivor objects to .  If\nmost objects die young, we can focus GC effort on newspace, to avoid\ntraversing all of oldspace all the time.remembered setnewspaceoldspace\nCollecting a subspace instead of the whole heap is sound if and only if\nwe can identify all live objects in the subspace.  We start with some\nset of  that point into the subspace from outside, and then\ntraverse all links in those objects, but only to other objects within\nthe subspace.roots\nThe roots are, like, global variables, and the stack, and registers; and\nin the case of a partial collection in which we identify …",
          "link": "https://wingolog.org/archives/2024/01/05/v8s-precise-field-logging-remembered-set",
          "publishedOn": "2024-01-05T09:44:21.000Z",
          "wordCount": 1814,
          "title": "v8's precise field-logging remembered set",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/14/service-update",
          "author": null,
          "description": "Late last year I switched blog entries and comments to be written in , but there was a bug that I never noticed: if a text consisted only of a single paragraph or block, it would trigger an error that got reported back to the user in a very strange way, and which would prevent the comment from being posted.a dialect of markdown\nI had never seen the error myself because blog posts are generally more than a paragraph, but it must have been quite irritating when commenting.  Sorry about that; it should be fixed now.  Should you experience more strange errors, please do send me an email with the comment to .  Cheers.wingo@igalia.com",
          "link": "https://wingolog.org/archives/2023/12/14/service-update",
          "publishedOn": "2023-12-14T14:28:45.000Z",
          "wordCount": 884,
          "title": "service update",
          "imageUrl": null
        },
        {
          "id": "https://wingolog.org/archives/2023/12/12/sir-talks-a-lot",
          "author": null,
          "description": "I know, dear reader: of course you have already seen all my talks this year.  Your attentions are really too kind and I thank you.  But those other people, maybe you share one talk with them, and then they ask you for more, and you have to go stalking back through the archives to slake their nerd-thirst.  This happens all the time, right?\nI was thinking of you this morning and I said to myself, why don’t I put together a post linking to all of my talks in 2023, so that you can just send them a link; here we are.  You are very welcome, it is really my pleasure.\n  Wasm\nstandards group, Munich, 11 Oct 2023.\nScheme + Wasm + GC = MVP: Hoot Scheme-to-Wasm compiler update.slides\n\nWasm GC subgroup, 18 Apr 2023.\nScheme to Wasm: Use and misuse of the GC proposal.slides\n\nBOB, Berlin, 17 Mar 2023.\n\n\nA world to win: WebAssembly for the rest of us.blogslidesyoutube\n\nEOSS, Prague, 27 June 2023.\n\n\n\n\n\n\n\nCross-platform mobile UI: “Compilers, compilers everywhere”.slidesyoutubeblogblogblogblogblogblog\n\nSpritely, remote, 10 May 2023.\n\nCPS Soup: A functional intermediate language.blogslides\n\nFOSDEM, Brussels, 4 Feb 2023.\n\n\nWhippet: A new GC for Guile.blogeventslides\nStill here?  The full  will surely fill your cup.talks archive\n2023 talks\nbut wait, there’s more",
          "link": "https://wingolog.org/archives/2023/12/12/sir-talks-a-lot",
          "publishedOn": "2023-12-12T15:18:14.000Z",
          "wordCount": 1121,
          "title": "sir talks-a-lot",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Planet Lisp",
      "feedUrl": "http://planet.lisp.org/rss20.xml",
      "siteUrl": "http://planet.lisp.org/",
      "articles": [
        {
          "id": "http://within-parens.blogspot.com/2024/03/a-rant-about-r-and-python-and-anything.html",
          "author": null,
          "description": "R and Python come from Lisp (R for sure, Python will deny it). Early Lisp.\n  Even before the first edition of \"AI Programming\" by Charniak, Riesbek and McDermott.\n\n\n\n  At that time, there were a-lists and p-lists. Then Charniak, Riesbeck and\n  McDermott taught us (not only them of course) to create records in\n  Lisp. You know... those things like:\n\n    DECLARE\n      1 STUDENT,\n        2 NAME     CHAR (30),\n        2 SURNAME  CHAR (50),\n        2 ID FIXED DECIMAL (8),\n        2 ADDRESS,\n          3 STREET  CHAR (80),\n          3 NUMBER  FIXED DECIMAL (5),\n          3 CITY    CHAR (80),\n          3 PRST    CHAR (20),\n          3 ZIP     CHAR (10),\n          3 COUNTRY CHAR (80);\n\n\nUsing a-lists the above may become:\n    (defvar student '((name . \"John\")\n                      (surname . \"Bluta…",
          "link": "http://within-parens.blogspot.com/2024/03/a-rant-about-r-and-python-and-anything.html",
          "publishedOn": "2024-03-03T13:35:00.000Z",
          "wordCount": 2319,
          "title": "Marco Antoniotti: A Rant about R and Python (and anything with a-lists, tuples and \"dictionaries\").",
          "imageUrl": null
        },
        {
          "id": "http://blog.funcall.org//lisp/2024/02/27/deannoyify-slime/",
          "author": null,
          "description": "Over all these years I don't think I ever wanted to close all existing SLIME connections when attaching to a remote host. Similarly, the version mismatch between SWANK and SLIME frontend has never stopped me following through with connection. I did however fumbled with y/n confirmations plenty of times. The snippet below removes these interactive checks.\n\n\n\n1\n2\n3\n4\n5\n6\n7\n8\n9\n10\n11\n12\n13\n14\n15\n16\n17\n18\n19\n20\n21\n22\n\n(defun slime-check-version (version conn)\n  (or (equal version slime-protocol-version)\n      (equal slime-protocol-version 'ignore)\n      (message\n       (format \"Versions differ: %s (slime) vs. %s (swank).\"\n               slime-protocol-version version))\n      (slime-net-close conn)\n      (top-level)))\n\n(defun slime-connect (host port &optional _coding-system interactive-p &rest…",
          "link": "http://blog.funcall.org//lisp/2024/02/27/deannoyify-slime/",
          "publishedOn": "2024-02-26T15:00:00.000Z",
          "wordCount": 285,
          "title": "Eugene Zaikonnikov: Deannoyifying SLIME",
          "imageUrl": null
        },
        {
          "id": "https://journal.paoloamoroso.com/reading-a-programmers-guide-to-common-lisp?pk_campaign=rss-feed",
          "author": null,
          "description": "I got a cheap used copy of the book A Programmer's Guide to COMMON LISP by Deborah G. Tatar, Digital Press, 1987.\n\nWhy did I read such an old book, published a few years after CLtL1 and well before ANSI finalized the Common Lisp standard?\nI'm always looking for good Lisp books. Since Medley is my primary Lisp environment, I'm particularly interested in books published when the system was originally developed and used. These works are relevant because they cover a set of features close to the state of the Common Lisp implementation of Medley, and present a programming style typical of Lisp development in those years.\nTwo old reviews got me curious about A Programmer's Guide to COMMON LISP, one by Daniel Weinreb and the other by Richard Caruana.\nBoth reviews point out the book is different from most contemporary introductory Lisp books which focus on AI. Although Tatar's does contain some AI code, such as an interesting and complete toy expert system, the sample code spans a wider range of domains like a text formatter similar to nroff.\nWhat sets A Programmer's Guide to COMMON LISP apart from other Lisp books is its environment independent discussion of the interactive Lisp programming process. Writing code in the editor, evaluating expressions from the editor, interacting with the REPL for testing expressions and exploring, and so on.\nI've never seen the process expressed so clearly in any book, past of present. I'm familiar with it but the material is particulary helpful for complete beginners.\nAlthough the short chapter on macros presents some interesting examples like a simplified version of defstruct, it doesn't discuss gensym and variable capture. This is unusual. But it's only one of a few issues and the book is a valuable addition to my Lisp library.\n#CommonLisp #books #Lisp\nDiscuss...\nEmail | Reply @amoroso@fosstodon.org",
          "link": "https://journal.paoloamoroso.com/reading-a-programmers-guide-to-common-lisp?pk_campaign=rss-feed",
          "publishedOn": "2024-02-22T11:04:59.000Z",
          "wordCount": 818,
          "title": "Paolo Amoroso: Reading A Programmer's Guide to COMMON LISP",
          "imageUrl": "https://i.snap.as/tqNa1b4B.jpg"
        },
        {
          "id": "https://journal.paoloamoroso.com/importing-common-lisp-files-in-medley-with-textmodules?pk_campaign=rss-feed",
          "author": null,
          "description": "Medley is a residential environment for Interlisp and Common Lisp development.\nWith some effort it's possible to use Medley as a traditional file based Common Lisp environment. But in specific cases a better approach is to bring in Medley's residential environment Common Lisp sources created in file based environments.\nIn this post I explain the latter, i.e. how to use TextModules to import Common Lisp files into the residential environment. I go over the steps for converting an example program, the database of CD music tracks in Chapter 3 Practical: A Simple Database of Peter Seibel's book Practical Common Lisp.\nMotivation\nUsing the tools and facilities of the residential environment, such as the File Manager, is the normal way of developing new Lisp programs. To run existing Common Lisp …",
          "link": "https://journal.paoloamoroso.com/importing-common-lisp-files-in-medley-with-textmodules?pk_campaign=rss-feed",
          "publishedOn": "2024-02-18T11:44:04.000Z",
          "wordCount": 1866,
          "title": "Paolo Amoroso: Importing Common Lisp Files in Medley with TextModules",
          "imageUrl": "https://i.snap.as/68i8povn.jpg"
        },
        {
          "id": "https://lisp-journey.gitlab.io/blog/celebrating-1001-learners-on-my-common-lisp-course/",
          "author": null,
          "description": "I just got 1001 learners on my Common Lisp\ncourse\non Udemy. Thanks everybody for your support, here or elsewhere!\nStarting with CL was honestly not easy. The first thing I did was\nwriting the “data structures” page on the Cookbook, bewildered that it\ndidn’t exist yet. A few years and a few projects later, this course\nallows me to share more, learn more, have fun, and have some rewards\nto keep the motivation up.\n\nI know the course isn’t complete by any means, I want to add many\nchapters, both advanced topics but easier material for newcomers as\nwell (beware, my course isn’t for total beginners in a Lisp\nlanguage). The next one, and soon©, will be all about CLOS. In the\nmeantime, I don’t abandon you, I enhance the Cookbook, I publish some\nvideos on Youtube (last one: web development in Common Lisp, part 1\nand part 2), I work on\nstarter kits or on newcomer-friendly libraries ;)\nThanks again,\ndon’t hesitate to share the link with a friend or a colleague ;)\nHere’s a link with a coupon until March, 13th 2024. (student? Get in touch for a free link)\nmore information on Github",
          "link": "https://lisp-journey.gitlab.io/blog/celebrating-1001-learners-on-my-common-lisp-course/",
          "publishedOn": "2024-02-14T16:05:44.000Z",
          "wordCount": 677,
          "title": "vindarel: Celebrating 1001 learners on my Common Lisp course &#129395;",
          "imageUrl": "/images/default.png"
        },
        {
          "id": "http://funcall.blogspot.com/2024/02/bilinear-fractional-transformations.html",
          "author": null,
          "description": "A bilinear fractional transformation (BiLFT) is a\n  two-argument function of the form\n(lambda (x y)\n  (/ (+ (* A x y) (* B x) (* C y) D)\n     (+ (* E x y) (* F x) (* G y) H)))\nBiLFTs do not form a group\n  under functional composition with LFTs, but they have this\n  interesting property:  if you hold either input to the BiLFT constant,\n  the BiLFT becomes a LFT on the other input.  So if we consider just\n  one of the inputs at a time (or the output), we can apply some\n  group-like operations.\nYou can compose LFTs with BiLFTs in three ways.  First,\n  you can run the output of a BiLFT into the input of a LFT.  Second\n  and third, you can run the output of a LFT into the either the x or\n  y input of a BiLFT.  Composing a LFT with a BiLFT in any of these\n  ways produces another BiLFT, so there …",
          "link": "http://funcall.blogspot.com/2024/02/bilinear-fractional-transformations.html",
          "publishedOn": "2024-02-10T16:40:00.000Z",
          "wordCount": 4711,
          "title": "Joe Marshall: Bilinear Fractional Transformations",
          "imageUrl": null
        },
        {
          "id": "https://journal.paoloamoroso.com/managing-pure-common-lisp-files-on-medley?pk_campaign=rss-feed",
          "author": null,
          "description": "Managing Lisp code in the residential environment of Medley differs from similar tasks in traditional file based Common Lisp systems.\nIn a previous post I explained how the residential environment of Medley works, discussed some of its facilities and tools, and introduced a workflow for managing Common Lisp code under the residential environment. This leverages the way Medley is designed to work and minimizes friction.\nIn this post I explain how to use Medley as a file based environment, albeit with some friction and reduced functionality.\nI show how to edit, organize, and load pure Common Lisp files, i.e. source files not under the control of the File Manager. Pure files are ordinary text files that contain only Common Lisp code, with no metadata or font control commands like the code dat…",
          "link": "https://journal.paoloamoroso.com/managing-pure-common-lisp-files-on-medley?pk_campaign=rss-feed",
          "publishedOn": "2024-02-08T11:17:13.000Z",
          "wordCount": 1554,
          "title": "Paolo Amoroso: Managing pure Common Lisp files on Medley",
          "imageUrl": "https://i.snap.as/68i8povn.jpg"
        },
        {
          "id": "http://funcall.blogspot.com/2024/02/infinite-composition.html",
          "author": null,
          "description": "If you like functional composition, you’ll like linear\n  fractional transformations (LFTs).  They behave very nicely when you\n  compose them (in fact, they are a group under functional\n  composition).  If you compose two LFTs, you get another LFT.  You\n  can keep composing as long as you wish.  Let’s compose an\n  infinite number of LFTs.\nI suppose I should argue that composing an infinite number of LFTs\n  will give you anything at all.  Consider those LFTs with\n  non-negative coefficients.  When given an input in the range [0,∞],\n  they will output a number in the range [A/C, B/D].  The output range\n  is narrower than, and contained within, the input range.  If we compose two such LFTs, the\n  range of output of the outermost LFT will be even narrower.  As we\n  compose more and more of thes…",
          "link": "http://funcall.blogspot.com/2024/02/infinite-composition.html",
          "publishedOn": "2024-02-04T17:37:00.000Z",
          "wordCount": 4931,
          "title": "Joe Marshall: Infinite Composition",
          "imageUrl": null
        },
        {
          "id": "http://blog.funcall.org//lisp/2024/01/31/slime-xref/",
          "author": null,
          "description": "By the nature of embedded development one spends a lot of time debugging on target devices. SLIME experience for the most part is as smooth as on local host with the exception of cross referencing. Swank backend on target is reporting local paths in xref records which the frontend on your host then tries to open.\nThe canonical workaround from the user manual is using slime-tramp contrib, allowing you to navigate the source tree on remote target over SSH. I however greatly prefer to work on the local copy of the source code, with much lower latency (SSH over VPN over cellular to a remote site is no fun) and ability to stage and commit changes immediately. A somehwat kludgy workflow that does the trick is using a hacked slime-postprocess-xref below to substitute $HOME in xref records. The so…",
          "link": "http://blog.funcall.org//lisp/2024/01/31/slime-xref/",
          "publishedOn": "2024-01-30T15:00:00.000Z",
          "wordCount": 374,
          "title": "Eugene Zaikonnikov: Tweaking SLIME Xref for Remote Images",
          "imageUrl": null
        },
        {
          "id": "http://kvardek-du.kerno.org/2024/01/manuel-simoni-on-cls-control-flow.html",
          "author": null,
          "description": "Manuel Simoni dusts his Axis of Eval blog off and writes about Common Lisp's BLOCK / RETURN-FROM and UNWIND-PROTECT. A summary for non-Lispers.",
          "link": "http://kvardek-du.kerno.org/2024/01/manuel-simoni-on-cls-control-flow.html",
          "publishedOn": "2024-01-30T14:56:00.000Z",
          "wordCount": 895,
          "title": "Luís Oliveira: Manuel Simoni on CL's control flow primitives",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "hyPiRion",
      "feedUrl": "https://hypirion.com/rss/all",
      "siteUrl": "https://hypirion.com",
      "articles": [
        {
          "id": "https://hypirion.com/musings/implementing-system-versioned-tables-in-postgres",
          "author": null,
          "description": "There's no official support for system-versioned tables in Postgres yet, and the temporal extensions aren't supported on Azure/AWS/GCP. Let's implement it ourselves with 3 triggers and an index.",
          "link": "https://hypirion.com/musings/implementing-system-versioned-tables-in-postgres",
          "publishedOn": "2024-01-21T20:20:00.000Z",
          "wordCount": 3548,
          "title": "Implementing System-Versioned Tables in Postgres",
          "imageUrl": "https://hypirion.com/thumbnails/postgres-wormhole.jpg"
        },
        {
          "id": "https://hypirion.com/musings/haunting-down-errors-in-go",
          "author": null,
          "description": "Phantom types won't revolutionise your Go debugging experience, but it can make it slightly better! Here's one way they can help out.",
          "link": "https://hypirion.com/musings/haunting-down-errors-in-go",
          "publishedOn": "2023-08-06T18:43:00.000Z",
          "wordCount": 1202,
          "title": "Haunting Down Errors in Go",
          "imageUrl": "https://hypirion.com/thumbnails/this-is-fine-errnorows.png"
        },
        {
          "id": "https://hypirion.com/musings/go-stly-access-rights",
          "author": null,
          "description": "With phantom types, we can make a static access control system in Go that will detect errors and act as easy-to-read documentation. Here's how you do it.",
          "link": "https://hypirion.com/musings/go-stly-access-rights",
          "publishedOn": "2023-07-23T14:00:00.000Z",
          "wordCount": 2147,
          "title": "Go-stly Access Rights",
          "imageUrl": "https://hypirion.com/thumbnails/screampher.jpg"
        },
        {
          "id": "https://hypirion.com/musings/spectral-contexts-in-go",
          "author": null,
          "description": "Go has phantom types, and we can use them to attach singletons to contexts. Here is a short post on how to do just that.",
          "link": "https://hypirion.com/musings/spectral-contexts-in-go",
          "publishedOn": "2023-06-18T17:00:00.000Z",
          "wordCount": 693,
          "title": "Spectral Contexts in Go",
          "imageUrl": "https://hypirion.com/thumbnails/phantom-types-in-go.jpg"
        },
        {
          "id": "https://hypirion.com/musings/graphql-and-type-systems",
          "author": null,
          "description": "Like Go, GraphQL isn't at the forefront of type theory. Let's look at what I miss and whether it would be sensible to add them to the specification.",
          "link": "https://hypirion.com/musings/graphql-and-type-systems",
          "publishedOn": "2023-05-28T15:45:00.000Z",
          "wordCount": 2151,
          "title": "GraphQL and Type Systems",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "(think)",
      "feedUrl": "https://batsov.com/atom.xml",
      "siteUrl": "https://batsov.com/",
      "articles": [
        {
          "id": "https://batsov.com/articles/2024/02/27/m-x-reloaded-the-second-golden-age-of-emacs/",
          "author": null,
          "description": "The people who live in a Golden Age usually go around complaining how yellow everything looks. – Randall Jarell",
          "link": "https://batsov.com/articles/2024/02/27/m-x-reloaded-the-second-golden-age-of-emacs/",
          "publishedOn": "2024-02-27T08:08:00.000Z",
          "wordCount": 1912,
          "title": "M-x Reloaded: The Second Golden Age of Emacs",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/26/emacs-dead-and-loving-it/",
          "author": null,
          "description": "What is dead cannot die. – A Song of Ice and Fire (a.k.a. Game of Thrones)",
          "link": "https://batsov.com/articles/2024/02/26/emacs-dead-and-loving-it/",
          "publishedOn": "2024-02-26T09:47:00.000Z",
          "wordCount": 1242,
          "title": "Emacs: Dead and Loving It",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/23/ocaml-adds-list-take-and-list-drop/",
          "author": null,
          "description": "One of my small issues with OCaml is that the standard library is quite spartan. Sometimes it misses functions that are quite common in other (similar) languages. One such example are functions like drop, drop_while, take and take_while in the List module.1 What’s weird is that the similar Seq module features all those functions since OCaml 4.14. I believe it was Haskell that populirized them. &#8617;",
          "link": "https://batsov.com/articles/2024/02/23/ocaml-adds-list-take-and-list-drop/",
          "publishedOn": "2024-02-23T07:12:00.000Z",
          "wordCount": 677,
          "title": "OCaml Adds `List.take` and `List.drop`",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/22/asciidoc-language-specification/",
          "author": null,
          "description": "I’m an avid fan of AsciiDoc and I’ve been using it for years to write documentation for some of my OSS projects (e.g. CIDER and Projectile). I try to keep tracking of developments around AsciiDoc, but it seems I’ve missed a few quite notable ones:",
          "link": "https://batsov.com/articles/2024/02/22/asciidoc-language-specification/",
          "publishedOn": "2024-02-22T13:14:00.000Z",
          "wordCount": 937,
          "title": "AsciiDoc Language Specification",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/16/revisiting-mastodon/",
          "author": null,
          "description": "After my recent article on Bluesky something rather unexpected happened. I noticed a link to an interesting post on Mastodon and when I signed in to check it out, I was surprised to see that my feed there was pretty active. There were many familiar people (mostly from the Emacs, Clojure and Ruby communities) and some pretty nice conversations going on. That got me thinking if I should revisit it.",
          "link": "https://batsov.com/articles/2024/02/16/revisiting-mastodon/",
          "publishedOn": "2024-02-16T08:15:00.000Z",
          "wordCount": 657,
          "title": "Revisiting Mastodon",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/12/bluesky/",
          "author": null,
          "description": "Remember me trying out Mastodon a while ago? Well, it didn’t stick. For various reasons.",
          "link": "https://batsov.com/articles/2024/02/12/bluesky/",
          "publishedOn": "2024-02-12T20:33:00.000Z",
          "wordCount": 551,
          "title": "Bluesky",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/02/12/curbing-my-email-mania/",
          "author": null,
          "description": "In the end, there can be only one. – Highlander",
          "link": "https://batsov.com/articles/2024/02/12/curbing-my-email-mania/",
          "publishedOn": "2024-02-12T20:18:00.000Z",
          "wordCount": 532,
          "title": "Curbing My Email Mania",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/01/16/learning-ocaml-verifying-tail-recursion-with-tailcall/",
          "author": null,
          "description": "How can you be sure that an OCaml function you wrote is actually tail-recursive? You can certainly compile the code and look at the generated assembly code, but that’d be quite the overkill, given there is a much simpler way to do this.",
          "link": "https://batsov.com/articles/2024/01/16/learning-ocaml-verifying-tail-recursion-with-tailcall/",
          "publishedOn": "2024-01-16T08:52:00.000Z",
          "wordCount": 593,
          "title": "Learning OCaml: Verifying tail-recursion with @tailcall",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2024/01/16/2023-the-year-in-review/",
          "author": null,
          "description": "Life can only be understood backwards; but it must be lived forwards. – Søren Kierkegaard",
          "link": "https://batsov.com/articles/2024/01/16/2023-the-year-in-review/",
          "publishedOn": "2024-01-16T08:43:00.000Z",
          "wordCount": 1406,
          "title": "2023: The Year in Review",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        },
        {
          "id": "https://batsov.com/articles/2023/12/23/a-bad-year-for-blogging/",
          "author": null,
          "description": "Last year (2022) I celebrated a rather unexpected all time blogging record. As it often happens in such cases, however, there was a massive drop in my blogging activity afterwards.",
          "link": "https://batsov.com/articles/2023/12/23/a-bad-year-for-blogging/",
          "publishedOn": "2023-12-23T06:34:00.000Z",
          "wordCount": 606,
          "title": "A Bad Year for Blogging",
          "imageUrl": "https://batsov.com/assets/images/bozhidar_avatar.jpg"
        }
      ]
    },
    {
      "title": "Lambda/Sierra",
      "feedUrl": "https://www.lambdasierra.com/feed.xml",
      "siteUrl": "https://www.lambdasierra.com/",
      "articles": [
        {
          "id": "urn:uuid:6ad33810-d508-4ddc-a102-85513e520e95",
          "author": null,
          "description": "The ongoing conflict between DBAs and developers over control of analytical data",
          "link": "https://www.lambdasierra.com/2024/versus",
          "publishedOn": "2024-03-02T23:00:00.000Z",
          "wordCount": 290,
          "title": "Versus",
          "imageUrl": null
        },
        {
          "id": "urn:uuid:71d51fbc-5910-4253-81fa-56366970fcac",
          "author": null,
          "description": "WordPress.com is offering a 100-year plan. But why?",
          "link": "https://www.lambdasierra.com/2023/100-year-plan/",
          "publishedOn": "2023-11-05T20:00:00.000Z",
          "wordCount": 861,
          "title": "You Bet Your Life",
          "imageUrl": "https://www.lambdasierra.com/2023/100-year-plan/img/100-year-plan.jpg"
        },
        {
          "id": "urn:uuid:a8d0b690-8938-4743-902a-c6978ba7ef0c",
          "author": null,
          "description": "A plea to technical writers: Please stop inventing abbreviations and acronyms without defining them.",
          "link": "https://www.lambdasierra.com/2023/abbreviating/",
          "publishedOn": "2023-06-03T18:30:00.000Z",
          "wordCount": 800,
          "title": "Stop Abbreviating!",
          "imageUrl": "https://www.lambdasierra/2023/img/flowchart.svg"
        },
        {
          "id": "urn:uuid:417d13a1-0e74-48b4-93da-715fbe03736e",
          "author": null,
          "description": "Social media killed comments. What's a lonely blogger to do?",
          "link": "https://www.lambdasierra.com/2023/building/comments",
          "publishedOn": "2023-05-20T20:00:00.000Z",
          "wordCount": 395,
          "title": "One-Way Comments?",
          "imageUrl": "https://www.lambdasierra/2023/building/img/stephen-phillips-hostreviews-co-uk--zRNvl3EUdw-unsplash.jpg"
        }
      ]
    },
    {
      "title": "Squid's Blog",
      "feedUrl": "http://gigasquidsoftware.com/atom.xml",
      "siteUrl": "http://gigasquid.github.io/atom.xml",
      "articles": [
        {
          "id": "http://gigasquid.github.io/blog/2023/07/02/ciphers-with-vector-symbolic-architectures/",
          "author": null,
          "description": "A secret message inside a 10,000 hyperdimensional vector\nWe’ve seen in previous posts how we can encode data structures using Vector Symbolic Architectures in Clojure. This is an exploration of how we can use this to develop a cipher to transmit a secret message between two parties.\nA Hyperdimensional Cipher\nUsually, we would develop a dictionary/ cleanup memory of randomly chosen hyperdimensional vectors to represent each symbol. We could do this, but then sharing the dictionary as our key to be able to decode messages would be big. Instead, we could share a single hyperdimensional vector and then use the protect/ rotation operator to create a dictionary of the alphabet and some numbers to order the letters. Think of this as the initial seed symbol and the rest being defined as n+1.\n\n\n\n1\n…",
          "link": "http://gigasquid.github.io/blog/2023/07/02/ciphers-with-vector-symbolic-architectures/",
          "publishedOn": "2023-07-02T16:31:00.000Z",
          "wordCount": 915,
          "title": "Ciphers With Vector Symbolic Architectures",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Aditya Athalye writes and works here.",
      "feedUrl": "https://www.evalapply.org/index.xml",
      "siteUrl": "https://www.evalapply.org/",
      "articles": [
        {
          "id": "https://www.evalapply.org/posts/halting-ai/",
          "author": null,
          "description": "The current wave of AI tools is incredibly cool. I hope more people get distracted by the incredible coolness and bet on this wave of AI, because I'm betting the other way, on the hot mess of human general intelligence.",
          "link": "https://www.evalapply.org/posts/halting-ai/index.html",
          "publishedOn": "2024-03-13T00:00:00.000Z",
          "wordCount": 1521,
          "title": "Halting AI",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/mycelium-clj/",
          "author": null,
          "description": "In a world of concrete objects, steel frameworks bring sense and order. In a forest of composable tools, libraries and open-ended schemas, it would be the mycelia. A frustrated yet optimistic man muses \"Might such a thing come to be?\".",
          "link": "https://www.evalapply.org/posts/mycelium-clj/index.html",
          "publishedOn": "2023-10-19T00:00:00.000Z",
          "wordCount": 1101,
          "title": "Riff: A \"mycelium-clj\" for the Clojure ecosystem?",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-ide-experience/",
          "author": null,
          "description": "The one in which we design a rich Integrated Development Environment (IDE) experience, using Clojure as our muse. Featuring Language Server Protocol (lsp-mode + clojure-lsp), clojure-mode, cider, and more! Buckle up and get a coffee.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-ide-experience/index.html",
          "publishedOn": "2023-09-07T00:00:00.000Z",
          "wordCount": 4780,
          "title": "Emerging from dotemacs bankruptcy the hard way: integrating the IDE (feat. Clojure(Script))",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-getting-about/",
          "author": null,
          "description": "We want to maximize our ability to \"stay in The Zone\". So the aim is to create the fastest, smoothest, tightly integrated, and unobtrusive mechanism to get things done using the keyboard alone.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-getting-about/index.html",
          "publishedOn": "2023-08-02T00:00:00.000Z",
          "wordCount": 2926,
          "title": "Emerging from dotemacs bankruptcy the hard way: getting about",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-midway-refactor/",
          "author": null,
          "description": "Or the one in which we confront our elisp n00bishness and try to be better at using it. And we learn new habits to understand our Emacs better. Better late than never.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-midway-refactor/index.html",
          "publishedOn": "2023-07-23T00:00:00.000Z",
          "wordCount": 1826,
          "title": "Emerging from dotemacs bankruptcy the hard way: the midway refactor",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-packages/",
          "author": null,
          "description": "Elpa, Melpa, git repo. Vendor package straight from source. It compiled? Fetch some more! Elpa, Melpa, git repo. In more adult terms, we learn to use use-package to fetch, install, initialise, configure useful packages that enhance our Emacs experience.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-packages/index.html",
          "publishedOn": "2023-07-06T00:00:00.000Z",
          "wordCount": 1615,
          "title": "Emerging from dotemacs bankruptcy the hard way: package management",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-init-begins/",
          "author": null,
          "description": "The first action must, of course, be to colour the bikeshed and set some decent defaults.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy-init-begins/index.html",
          "publishedOn": "2023-07-04T00:00:00.000Z",
          "wordCount": 757,
          "title": "Emerging from dotemacs bankruptcy the hard way: init begins",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy/",
          "author": null,
          "description": "Or, finally biting the bullet to redesigning my developerly and writerly experience, from the ground up, with Emacs.",
          "link": "https://www.evalapply.org/posts/emerging-from-dotemacs-bankruptcy/index.html",
          "publishedOn": "2023-06-29T00:00:00.000Z",
          "wordCount": 634,
          "title": "Emerging from dotemacs bankruptcy the hard way: Prelude",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/what-have-you-been-curious-about/",
          "author": null,
          "description": "Arguably a more interesting, revealing, and kinder question than \"What are you curious about?\"",
          "link": "https://www.evalapply.org/posts/what-have-you-been-curious-about/index.html",
          "publishedOn": "2023-06-21T00:00:00.000Z",
          "wordCount": 528,
          "title": "What have you been curious about?",
          "imageUrl": null
        },
        {
          "id": "https://www.evalapply.org/posts/software-demos/",
          "author": null,
          "description": "Making a software demo is a form of deliberate, serious play. An act that feeds our curiosity, inventiveness, and drive. It enlivens. It enriches. It entertains. And as we asymptotically approach the A.G.I. that's just around the corner, the capacity for deliberate, serious play will remain distinctively, deeply, deliciously human. Career software people like yours truly may please take note!",
          "link": "https://www.evalapply.org/posts/software-demos/index.html",
          "publishedOn": "2023-06-04T00:00:00.000Z",
          "wordCount": 1658,
          "title": "Software demos as deliberate acts of serious play",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "Ian Henry",
      "feedUrl": "https://ianthehenry.com/feed.xml",
      "siteUrl": "https://ianthehenry.com/",
      "articles": [
        {
          "id": "https://ianthehenry.com/posts/how-to-learn-nix/nix-direnv/",
          "author": null,
          "description": "The reason I discovered an ancient blog post the other day was that I had something new to say about Nix for the first time in over two years.\nThe thing I want to say is this: nix-direnv is great. It fixes roughly every problem that I’ve had with nix-shell, and does so in a much nicer way than my previous ad-hoc solutions.\nThis is important because I mostly just use Nix to document and install per-project native dependencies. I do use it to install “global” tools as well, but that is rarely very interesting, and most of my interaction with Nix these days consists of editing small shell.nix files.\nBut it took a bit of doing to get to the point that I felt good about using Nix for this. For one thing, shells don’t register GC roots, which means that every time you collect garbage you have to…",
          "link": "https://ianthehenry.com/posts/how-to-learn-nix/nix-direnv/",
          "publishedOn": "2024-01-28T00:00:00.000Z",
          "wordCount": 1335,
          "title": "How to Learn Nix, Part 49: nix-direnv is a huge quality of life improvement",
          "imageUrl": "https://ianthehenry.com/checkerboard.png"
        },
        {
          "id": "https://ianthehenry.com/posts/how-to-learn-nix/installing-nix-on-macos/",
          "author": null,
          "description": "Note: I wrote the vast majority of this post on August 24, 2022, but I decided that it was a whiny rant that I didn’t want to publish. I came across the draft in January 2024, remembered that this entire series is a whiny rant, and decided to publish it anyway.\nI’ve been a happy Nix user for about 18 months now, and– well, not happy happy, but satisfied… no… not really satisfied either; perhaps it’s more of a resigned disgruntlement; a feeling that despite its many flaws, it’s still better than anything else out there, and I’ve invested so much time into it already that it would be a shame to give up now, so… am I describing Stockholm syndrome?\nI’ve been imprisoned in Nix’s castle for about 18 months now, and I recently came into a new laptop – one of those shiny blue numbers – so naturall…",
          "link": "https://ianthehenry.com/posts/how-to-learn-nix/installing-nix-on-macos/",
          "publishedOn": "2024-01-26T00:00:00.000Z",
          "wordCount": 2242,
          "title": "How to Learn Nix, Part 48: Installing (single-user) Nix on macOS",
          "imageUrl": "https://ianthehenry.com/checkerboard.png"
        },
        {
          "id": "https://ianthehenry.com/posts/fibonacci/",
          "author": null,
          "description": "When you think about the Fibonacci sequence, you probably imagine a swirling vortex of oscillating points stretching outwards to infinity:\n\n\n\nOkay, no, obviously you don’t. Yet.\nWhen you think about the Fibonacci sequence, you probably flush with a latent rage when you remember that it is, more often than not, the way that we introduce the concept of “recursive functions” to new programmers, in some sort of cruel hazing intended to make it harder for them to ever appreciate how recursion can help them write better programs. Sometimes we even add memoization, and call it “dynamic programming,” in order to impress upon them that even the most trivial problems deserve complex, inefficient solutions.\nEr, okay, you probably don’t think about the Fibonacci sequence much at all. It doesn’t, you k…",
          "link": "https://ianthehenry.com/posts/fibonacci/",
          "publishedOn": "2023-07-30T00:00:00.000Z",
          "wordCount": 5215,
          "title": "The Fibonacci Matrix",
          "imageUrl": "https://ianthehenry.com/posts/fibonacci/hero.png"
        },
        {
          "id": "https://ianthehenry.com/posts/my-kind-of-repl/",
          "author": null,
          "description": "I want to tell you about an idea that has had a huge influence on the way that I write software. And I mean that in the literal sense: it’s changed the way that I write software; it’s re-shaped my development workflow.\nThe idea is this: you can write programs that modify themselves.\nAnd I don’t mean macros or metaprogramming or anything fancy like that. I mean that you can write programs that edit their own source code. Like, the files themselves. The actual text files on disk that have your source code in them.\nThat’s not the whole idea, though. There’s more to it: you write programs that can edit themselves, and then you use that as your REPL.\nInstead of typing something into a prompt and hitting enter and seeing the output on stdout, you type something into a file and hit some editor ke…",
          "link": "https://ianthehenry.com/posts/my-kind-of-repl/",
          "publishedOn": "2023-07-05T00:00:00.000Z",
          "wordCount": 5535,
          "title": "My Kind of REPL",
          "imageUrl": "https://ianthehenry.com/posts/my-kind-of-repl/hero.png"
        }
      ]
    },
    {
      "title": "Applied Language musings",
      "feedUrl": "https://applied-langua.ge/posts/feed.rss",
      "siteUrl": "https://applied-langua.ge/posts/",
      "articles": [
        {
          "id": "https://zenodo.org/record/7816398",
          "author": null,
          "description": "The design and implementation of a non-moving parallel generational garbage collector for SBCL.",
          "link": "https://zenodo.org/record/7816398",
          "publishedOn": "2024-03-14T00:01:39.921Z",
          "wordCount": 636,
          "title": "Parallel garbage collection for SBCL",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/the-poverty-of-post-open-source.html",
          "author": null,
          "description": "Post-open source falls short on what improvements it was supposed to make. It prefigures a boring future, mostly because it carries on productivist logic, and makes programming even more of a difficult and esoteric tool. Capitalism isn't the only problem threatening peer production; it is rather threatened by more general principles, which even radicals can believe.",
          "link": "https://applied-langua.ge/posts/the-poverty-of-post-open-source.html",
          "publishedOn": "2024-03-14T00:01:36.954Z",
          "wordCount": 4249,
          "title": "The poverty of \"post-open\" source",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/i-dont-want-to-go-to-chel-c.html",
          "author": null,
          "description": "When \"simple\" programming languages aren't.",
          "link": "https://applied-langua.ge/posts/i-dont-want-to-go-to-chel-c.html",
          "publishedOn": "2024-03-14T00:01:36.939Z",
          "wordCount": 7575,
          "title": "I don't want to go to Chel-C",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/omrn-compiler.html",
          "author": null,
          "description": "A pile of regular expression derivatives, myths about Ediware, SIMD instruction selection and using the Common Lisp compiler as a backend for a regular expression compiler.",
          "link": "https://applied-langua.ge/posts/omrn-compiler.html",
          "publishedOn": "2024-03-14T00:01:36.891Z",
          "wordCount": 3092,
          "title": "The one-more-re-nightmare compiler",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/lisp-curse-redemption-arc.html",
          "author": null,
          "description": "Pondering marketing strategies, and how we aren't supposed to be productive in Common Lisp.",
          "link": "https://applied-langua.ge/posts/lisp-curse-redemption-arc.html",
          "publishedOn": "2024-03-14T00:01:36.880Z",
          "wordCount": 3276,
          "title": "The Lisp Curse Redemption Arc",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/zero-feet.html",
          "author": null,
          "description": "A systems language is a collection of things that don't fit into a modular language. There shouldn't be one.",
          "link": "https://applied-langua.ge/posts/zero-feet.html",
          "publishedOn": "2024-03-14T00:01:36.877Z",
          "wordCount": 2014,
          "title": "Zero Feet: a proposal for a systems-free Lisp",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/posts/the-next-700-virtual-machines.html",
          "author": null,
          "description": "Virtual machine will eat themselves, by being similar enough that most can subsume each other. This can be furthered by making it easier to target abstract machines, and using object capabilities to allow cohabitation of languages and incremental extension to languages.",
          "link": "https://applied-langua.ge/posts/the-next-700-virtual-machines.html",
          "publishedOn": "2024-03-14T00:01:36.875Z",
          "wordCount": 4640,
          "title": "The next 700 virtual machines",
          "imageUrl": null
        },
        {
          "id": "https://applied-langua.ge/~hayley/pmrgc.html",
          "author": null,
          "description": "How to build the new parallel GC for SBCL, and how to tell if it's working.",
          "link": "https://applied-langua.ge/~hayley/pmrgc.html",
          "publishedOn": "2024-03-14T00:01:36.815Z",
          "wordCount": 1293,
          "title": "Please test the parallel mark-region collector for SBCL",
          "imageUrl": null
        }
      ]
    },
    {
      "title": "The Scientific Coder",
      "feedUrl": "https://scientificcoder.com/rss.xml",
      "siteUrl": "https://scientificcoder.com",
      "articles": [
        {
          "id": "https://scientificcoder.com/user-defined-show-method-in-julia",
          "author": "Matthijs Cox",
          "description": "I often find myself looking for a way to write custom display methods for Julia types on the REPL. Time to write it down in a short pragmatic blog post, for you and my future self.\nWhat's the issue? When exploring on the Julia REPL or in notebooks, you display your own custom type, then it doesn't look always look the most informative. Let's say you have some type:\nstruct MyType    some_number::Float64    some_dict::Dictend\nYou can quickly make an object and display it.\njulia> obj = MyType(4.0, Dict(:x => 5))MyType(4.0, Dict(:x => 5))\nOkay... Julia basically shows the constructor of the object. I would like to see the field names, or maybe other information. Sometimes I want to see statistical properties for example, instead of the raw data.\nAs an alternative, to quickly see the field name…",
          "link": "https://scientificcoder.com/user-defined-show-method-in-julia",
          "publishedOn": "2023-07-18T13:24:13.000Z",
          "wordCount": 7212,
          "title": "User-defined Show Method in Julia",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1689686215391%2F469dd124-564a-4ccf-a118-c1c9f885f6b6.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/juliacon-local-eindhoven-2023",
          "author": "Matthijs Cox",
          "description": "I am very happy to announce that I am an organizer of the first city-level JuliaCon conference. This will be a one-day event in Eindhoven on December 1st, organized together with the PyData Eindhoven conference on November 30th (the day before).\nThe website is live: https://juliacon.org/local/eindhoven2023/. You can submit proposals, book early-bird tickets and consider joining as a volunteer.\nWe named it \"JuliaCon Local\" to avoid any confusion with the yearly Global JuliaCon, which is typically also associated with a city name. The date is also positioned in the winter, to be out of sync with the summer schedule of the Global JuliaCon conferences. People who could not attend the Global JuliaCon now have another opportunity to meet like-minded Julians and computational scientists in the industry and academia.\nMy apologies if I notify you via multiple channels, including my blog, but we are really excited about growing our scientific computing community in the area. Please consider sharing the news with your network. Of course everyone on the planet is welcome to join our conference! Hopefully we are paving the path to more city-level JuliaCon conferences.",
          "link": "https://scientificcoder.com/juliacon-local-eindhoven-2023",
          "publishedOn": "2023-07-11T07:23:12.000Z",
          "wordCount": 2746,
          "title": "JuliaCon Local Eindhoven 2023",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1689059863447%2Ff5218ac5-7cf2-4036-bbd4-b6f01ff19866.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/how-to-deploy-algorithms-anywhere",
          "author": "Matthijs Cox",
          "description": "Let's say you are an incredible scientific programmer. You've got some pretty math, machine learning model or scientific computing code. And you want to give it to other users. Maybe even turn it into a real product and make a profit from your work. How do you \"deploy\" that piece of code? Most scientists do not think much about this problem at all, but it can have a great influence on how you should develop your code.\nBasically, we need to take what you developed, turn it into something which can be given to the user, so they can install and use it in their computing environment. What to provide depends entirely on the environment of the user. So you'll first need to understand that: the so called \"production environment\", the environment in which your \"product\" or service will operate.\n\nT…",
          "link": "https://scientificcoder.com/how-to-deploy-algorithms-anywhere",
          "publishedOn": "2023-07-09T12:41:35.000Z",
          "wordCount": 21321,
          "title": "How to deploy algorithms anywhere?",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1688895403637%2Fca806aa8-49ad-41dd-ab25-b3ba2db8ffe6.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/fruity-composable-design-patterns-in-julia",
          "author": "Matthijs Cox",
          "description": "A design pattern is a repeatable solution to a common coding problem. Design patterns are not something beginner programmers typically think about a lot (that includes most scientists), they are probably focused on making their code work. At least that's what I did when I was a young programmer. At the other extreme such patterns can become a religion for people, where everything has to be a design pattern, or else the code is not considered good enough. However, people who make this mistake are not senior programmers either in my opinion. Senior programmers look for a balance between pure abstraction and simplicity (and many other requirements).\nThe Julia community has a special standing on design patterns: people don't really like them. In general the Julia community believes that design…",
          "link": "https://scientificcoder.com/fruity-composable-design-patterns-in-julia",
          "publishedOn": "2023-06-23T12:18:08.000Z",
          "wordCount": 15899,
          "title": "Fruity Composable Design Patterns in Julia",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1687522411556%2Fc781ad27-554c-48bd-b6fc-f42d5f629591.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/software-testing-for-scientists",
          "author": "Matthijs Cox",
          "description": "I am currently reading the book \"Software Engineering for Science.\" It is one giant complaint about how scientists are terrible at writing maintainable code for themselves. I won't go into all the pain, but I do recognize that pain deeply and have written about it elsewhere. Right now I am reading this book hoping to find solutions. So, what's the proposed solution? The book doesn't provide a simple answer, but one recurring topic is \"testing, testing, TESTING!\" So, let's talk about testing!\nWhy don't scientists test their code? Well, it turns out that most scientists do not have a software engineering background, yet they find themselves writing code and software for their work. Alternatively, they may collaborate heavily with software engineers, either in academia or in the industry. If …",
          "link": "https://scientificcoder.com/software-testing-for-scientists",
          "publishedOn": "2023-06-11T12:35:26.000Z",
          "wordCount": 20268,
          "title": "Software Testing for Scientists",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1685970744744%2F3005ed53-27a0-4856-92d6-26ece2b8fe52.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/the-nebulous-mysteries-of-scientific-coding",
          "author": "Matthijs Cox",
          "description": "There is a concept in meta-rationality called nebulosity. I will look up the definition later, but in my own words nebulosity means the following:\n\nNebulosity: a concept or problem is ill-defined. You cannot describe it perfectly. The boundaries of the concept are unclear.\n\nNebulosity drives rational people crazy, its worse than NP-hard. Rational people need well defined problems. Even if you can prove that the problem cannot be solved, at least the problem itself should be known. But is this always possible?\nYou may have a problem that you can barely describe to yourself. You may feel some shape of it, intuitively in your mind, but you cannot explain it perfectly. You notice that it is especially difficult to explain the problem to people unknown to the domain around the problem. There is…",
          "link": "https://scientificcoder.com/the-nebulous-mysteries-of-scientific-coding",
          "publishedOn": "2023-06-03T11:56:48.000Z",
          "wordCount": 13821,
          "title": "The Nebulous Mysteries of Scientific Coding",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1685191473723%2F77306972-8aa3-41d0-85f4-9efef520f341.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/scientific-software-institutes",
          "author": "Matthijs Cox",
          "description": "Have you ever gone through life completely oblivious to something? I recently experienced that sensation when I stumbled upon an entire ecosystem of institutions, only learning about them after starting this blog. These organizations are dedicated to promoting better scientific software, which aligns with the mission of my blog. I wanted to know what's going on, so let's have a look at what's out there.\nI noticed the names of the fields of \"scientific software\" vary a little, but I consider all of these roughly equivalent:\n\nScientific Software\n\nResearch Software Engineering (RSE)\n\nScientific Computing\n\nNumerical Computing\n\nYes, there are differences between them, but all of them involve turning scientific knowledge into algorithms and software, and writing software to do scientific researc…",
          "link": "https://scientificcoder.com/scientific-software-institutes",
          "publishedOn": "2023-05-31T12:34:28.000Z",
          "wordCount": 9237,
          "title": "Scientific Software Institutes",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1682844193827%2F1b0a1c9d-fb03-4a75-9ca0-d3cbcb52d52b.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        },
        {
          "id": "https://scientificcoder.com/clean-code-tips-for-scientists-1-reproducible-environments",
          "author": "Matthijs Cox",
          "description": "Author commentary: I am starting a \"clean code\" blog series with simple tips that you can integrate into your workflow. I often write long, complicated articles that try to teach a lot at once. This is an attempt to chop things up in bite-sized chunks. Note that the Clean Code books by Robert Martin are great, you should read them if you have time! If not, you can follow these short articles :)\nIf you've written a lot of scripts and shared some of those scripts with colleagues or others, then you probably encountered the problem that the code doesn't always work on their device, or produces different results. When this happens, people may quickly lose trust in your results and begin to ignore your work entirely. So making code reproducible is extremely important! Even if you are a scientis…",
          "link": "https://scientificcoder.com/clean-code-tips-for-scientists-1-reproducible-environments",
          "publishedOn": "2023-05-24T12:03:44.000Z",
          "wordCount": 10884,
          "title": "Clean Code Tips for Scientists #1 - Reproducible Environments",
          "imageUrl": "https://hashnode.com/utility/r?url=https%3A%2F%2Fcdn.hashnode.com%2Fres%2Fhashnode%2Fimage%2Fupload%2Fv1684413997401%2F753bc424-1698-4e8a-a951-cc7727a09e68.png%3Fw%3D1200%26h%3D630%26fit%3Dcrop%26crop%3Dentropy%26auto%3Dcompress%2Cformat%26format%3Dwebp%26fm%3Dpng"
        }
      ]
    },
    {
      "title": "妖怪世捨て人",
      "feedUrl": "https://tymoon.eu/api/reader/atom",
      "siteUrl": "https://reader.tymoon.eu/",
      "articles": [
        {
          "id": "https://reader.tymoon.eu/article/434",
          "author": null,
          "description": "It happens frequently enough that a conversation in some online chatroom veers over to the question of privacy in the modern world, and especially to the willingness people have to share oodles of their often very personal information with complete strangers online. I certainly appreciate and understand the fears of oversharing, after all there are a lot of very dangerous people out there that, if they decide to do so, can absolutely hugely impact if not ruin your life entirely. Despite this, I somehow can't help myself.\nI suppose I can't help myself in part because I lack the self confidence to even believe that anyone would read what I write, let alone find me to be attractive enough of a target to begin a harassment campaign specifically towards me. I fully realise the naivete of this b…",
          "link": "https://reader.tymoon.eu/article/434",
          "publishedOn": "2024-01-23T22:13:53.000Z",
          "wordCount": 5890,
          "title": "Reprocessing - Confession 94",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2719"
        },
        {
          "id": "https://reader.tymoon.eu/article/433",
          "author": null,
          "description": "I've been writing libraries for Common Lisp for over a decade now (lord almighty), and for most of that time I've tried to ensure that the libraries would, in the very least, work on all three major operating systems: Windows, Linux, and MacOS.\nUsually doing so isn't hard, as I can rely on the implementation and the language standard, but especially for libraries that deal with foreign code or operating system interfaces, a bit more work is needed. For the longest time I went the extra mile of providing that support myself, despite not being a MacOS user, and despite vehemently disapproving of Apple as a company and their treatment of users and developers.\nAbout two years ago, I stopped. I had had enough of all the extra work the platform put on me, for zero personal gain. Especially I had…",
          "link": "https://reader.tymoon.eu/article/433",
          "publishedOn": "2023-11-27T14:04:32.000Z",
          "wordCount": 412,
          "title": "The State of MacOS Support",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2517"
        },
        {
          "id": "https://reader.tymoon.eu/article/432",
          "author": null,
          "description": "I've been debating opening up a Patreon for many years and I've always been hesitant about accepting donations from people, but I think it's finally time to change my mind on that!\nWhy make a Patreon now?\nI've been working full time on Kandria and associated projects since 2020, and continue to do so today. All of the work that I've done as part of that has been released as open source software, including Kandria itself as well as the engine it runs on, Trial.\nSince the release, I've mostly focused on support and the pre-pre-production of my next title, which primarily involves adding new features to Trial that are necessary to create a full-3D game. I can't yet announce much about the game itself, other than that it is a character action game, meaning it features third-person hack and sla…",
          "link": "https://reader.tymoon.eu/article/432",
          "publishedOn": "2023-08-25T12:45:54.000Z",
          "wordCount": 561,
          "title": "I've opened up a Patreon - Confession 93",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2570"
        },
        {
          "id": "https://reader.tymoon.eu/article/431",
          "author": null,
          "description": "If you've read any of my preceding entries I would expect it to come as no surprise to you to see me write \"accepting who you are is really difficult.\" Though today I want to write about a few different facets of that than just the one you may be thinking about right now.\nNaturally, for only recently coming out as trans, accepting that I am a woman is a large part of what's been coursing through my brain. I know with absolute certainty by now that I'm not wrong on this, and yet it's still not easy to fully come to terms with it and not just know it, but also understand it completely. I know that coming out as trans did not change me, but rather let me be who I've always been, even more so. Despite that it's still not obvious even to me which of the many fragments of my personality that wer…",
          "link": "https://reader.tymoon.eu/article/431",
          "publishedOn": "2023-08-08T21:11:52.000Z",
          "wordCount": 1893,
          "title": "Selbstsamkeit - Confession 92",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2518"
        },
        {
          "id": "https://reader.tymoon.eu/article/430",
          "author": null,
          "description": "I don't like sleeping. I like the idea of sleep, but the practise of it seems all too often fraught with issues for me. I do consider myself fortunate that I don't suffer from any major sleeping disabilities like insomnia, but my quality of sleep is nevertheless far from ideal, despite adhering to a rather strict and regular sleeping schedule.\nI frequently grind my teeth during sleep, and so have started wearing a denture during the night. The denture makes things permanently uncomfortable, and I honestly don't know if it's the major cause of me grinding my teeth at this point. I definitely wouldn't be surprised at all if it exacerbates the problem. I don't know why I grind my teeth, though I figure that since most of the time I can't remember my dreams at all, and when I do, they're usual…",
          "link": "https://reader.tymoon.eu/article/430",
          "publishedOn": "2023-07-22T08:59:01.000Z",
          "wordCount": 2091,
          "title": "Die Toteninsel - Confession 91",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2537"
        },
        {
          "id": "https://reader.tymoon.eu/article/429",
          "author": null,
          "description": "Hello everyone. It's been a while since the last update. I apologise for the silence, things have slipped out of habit a little bit, and besides there's just been a lot of work on things that aren't easy to talk about. I'm still stuck in the R&D phase for the next game, and probably will continue to be there for a few more months before I can properly enter pre-production.\nI've really needed some space away from Kandria for a while, too. I did still release patches in the meantime to fix some egregious problems and bring the source back up to date with the latest changes in the Trial engine. The final DLC update with official modding support is still in the works, but given how little response there's been to the level editor update I'm not making it a big priority.\nThe financials for Kand…",
          "link": "https://reader.tymoon.eu/article/429",
          "publishedOn": "2023-06-13T15:23:27.000Z",
          "wordCount": 651,
          "title": "A status update on Kandria, Shirakumo, and me",
          "imageUrl": "https://studio.tymoon.eu/api/studio/file?id=2438"
        }
      ]
    }
  ],
  "cliVersion": "1.15.1"
}